{
  "love": [
    "Will my long-distance relationship survive the distance?",
    "Will I ever fully trust my partner again after being cheated on?",
    "Am I going to regret giving my ex another chance?",
    "Will my family ever accept my partner?",
    "Am I going to find someone who truly understands me?",
    "Will opening up about my insecurities push them away?",
    "Should I give my ex another chance or is it truly over?",
    "Should I bring up my jealousy or work through it alone?",
    "Is it wise to pursue this online connection in person?",
    "Should I stay with someone my family disapproves of?",
    "Is it wise to be vulnerable about my past trauma with my partner?",
    "Is my jealousy justified or rooted in my own insecurity?",
    "Is this relationship worth fighting for despite the red flags?",
    "Are my standards too high or am I settling for less?",
    "Is the distance actually protecting us from deeper issues?",
    "Are we speaking different love languages without realizing it?",
    "Why do I keep choosing emotionally unavailable partners?",
    "Why am I so afraid of physical intimacy?",
    "What causes me to feel jealous even when I know I'm loved?",
    "Why do I lose myself in relationships?",
    "When will I feel ready to love again after being betrayed?",
    "When is it time to stop trying to make this relationship work?",
    "How long should I wait for them to commit?",
    "Where is this situationship actually leading?",
    "Which of my dating patterns is sabotaging my chances at love?",
    "Where do I draw the line between compromise and losing myself?",
    "How can I rebuild trust after infidelity?",
    "How can I feel more secure in my relationship?",
    "How can I be honest about my needs without pushing them away?",
    "What steps should I take to heal from this toxic relationship?",
    "How can I stop comparing my relationship to others?",
    "How can I communicate my love language to my partner?",
    "What steps can I take to improve our physical intimacy?",
    "How can I tell the difference between intuition and insecurity?",
    "Is my heart truly ready to be seen by someone new?",
    "What does my attraction to unavailable people reveal about me?",
    "What is the real reason I keep going back to my ex?",
    "What does this red flag pattern in my relationships mean?",
    "What is my intuition telling me about this person I met online?",
    "What does self-love actually look like for me right now?"
  ],
  "career": [
    "Will I ever feel like I belong in this role?",
    "Will returning to work after my break set me back professionally?",
    "Am I going to burn out if I keep working at this pace?",
    "Will speaking up about discrimination help or hurt my career?",
    "Am I going to regret staying at this toxic job?",
    "Will my side hustle ever become my main source of income?",
    "Should I report the toxic behavior at work?",
    "Should I take this remote position even if I crave connection?",
    "Is it wise to leave a stable job to pursue my creative passion?",
    "Should I stay in a job that pays well but drains my soul?",
    "Is it wise to start over in a new industry at my age?",
    "Is my burnout a sign I need rest or a complete career change?",
    "Is this creative block temporary or telling me something deeper?",
    "Are my imposter feelings valid or holding me back unnecessarily?",
    "Is the toxic workplace affecting my mental health more than I realize?",
    "Are my career expectations realistic given my circumstances?",
    "Why do I feel like a fraud despite my accomplishments?",
    "Why do I keep being passed over for promotions?",
    "What causes me to procrastinate on important work projects?",
    "Why am I so resistant to delegating tasks?",
    "When will I feel confident enough to pursue my dream career?",
    "When is the right time to transition into retirement?",
    "How long should I stay at this job before it damages my career?",
    "Where is my professional path actually leading me?",
    "Which career opportunity aligns better with my values?",
    "What wisdom is my career frustration trying to reveal?",
    "How can I overcome imposter syndrome at work?",
    "How can I recover from burnout without quitting my job?",
    "How can I re-enter the workforce after years away?",
    "What steps should I take to escape this toxic work environment?",
    "How can I maintain boundaries while working remotely?",
    "How can I advocate for myself after being passed over?",
    "What steps can I take to unblock my creativity?",
    "How can I balance my side hustle with my main job?",
    "What is causing my creative blocks at work?",
    "What does my resistance to this promotion really mean?",
    "What is the true cost of staying in this unfulfilling job?",
    "What does my fear of retirement reveal about my identity?",
    "What is holding me back from asking for what I deserve?",
    "What does my burnout need me to understand?"
  ],
  "growth": [
    "Will I ever stop feeling like I'm pretending to be someone I'm not?",
    "Will this grief ever feel less heavy?",
    "Am I going to find my people and truly belong somewhere?",
    "Will I always struggle with perfectionism?",
    "Am I going to look back and regret not taking more risks?",
    "Will I find purpose after this major life transition?",
    "Should I let myself feel angry or keep pushing it down?",
    "Should I prioritize finding community or focus on myself first?",
    "Is it wise to pursue creative expression even if it leads nowhere?",
    "Should I confront the person who hurt me or let it go?",
    "Is it wise to distance myself from people I've outgrown?",
    "Is my identity crisis a breakdown or a breakthrough?",
    "Is my perfectionism protecting me or destroying me?",
    "Are my people-pleasing habits serving anyone including myself?",
    "Is this emptiness after divorce normal or something deeper?",
    "Are my procrastination patterns a sign of fear or misalignment?",
    "Why do I struggle to celebrate my own achievements?",
    "Why do I say yes when every part of me wants to say no?",
    "What causes me to compare myself to everyone around me?",
    "Why does my anger feel so scary to express?",
    "When will I stop waiting to feel ready before living my life?",
    "When will this season of transition finally settle?",
    "How long do I need to grieve before I can move forward?",
    "Where do I even begin to find my authentic self?",
    "Which parts of my old identity are worth keeping?",
    "Where can I find community that accepts the real me?",
    "How can I process grief I've been avoiding for years?",
    "How can I stop being a people pleaser without feeling guilty?",
    "How can I embrace imperfection and still feel worthy?",
    "What steps should I take to overcome procrastination?",
    "How can I stop comparing myself to others on social media?",
    "How can I express myself creatively without judgment?",
    "What steps can I take to release this anger I'm carrying?",
    "How can I rebuild my life after divorce?",
    "What is my procrastination trying to protect me from?",
    "What does this identity crisis want me to discover?",
    "What is underneath my need to please everyone?",
    "What does my perfectionism reveal about my fears?",
    "What is the gift hidden in this painful transition?",
    "What does my envy of others point me toward?"
  ],
  "health": [
    "Will I ever feel at peace in my own body?",
    "Am I going to find a treatment that actually helps my chronic pain?",
    "Will my fertility journey have a happy ending?",
    "Should I be more concerned about my sleep issues?",
    "Is it wise to try this alternative treatment approach?",
    "Is my relationship with food becoming unhealthy?",
    "Are my aging fears about vanity or something deeper?",
    "Is my body image struggle connected to past trauma?",
    "Why do I resist taking care of my physical health?",
    "What causes my insomnia to flare up?",
    "When will I feel strong enough to start my recovery journey?",
    "How long until I feel comfortable in my changing body?",
    "Where is my resistance to exercise actually coming from?",
    "Which health habit would have the biggest impact right now?",
    "How can I make peace with my chronic condition?",
    "How can I develop a healthier relationship with food?",
    "What steps should I take to improve my sleep?",
    "How can I stay motivated on my fitness journey?",
    "What role does my mental health play in my physical wellbeing?",
    "What does my addiction want me to understand about myself?"
  ],
  "family": [
    "Will reaching out to my estranged family member make things worse?",
    "Am I ready to open my heart and home through adoption or fostering?",
    "Will my blended family ever truly feel like one unit?",
    "How do I parent differently than I was parented?",
    "Should I share the family secret I've been keeping?",
    "Is it wise to accept this inheritance given the family conflict?",
    "Is my relationship with my chosen family as valid as blood ties?",
    "Are my different values worth the family conflict they cause?",
    "Why does caring for my aging parents feel so overwhelming?",
    "What causes the tension between me and my stepchildren?",
    "When is the right time to tell my family my truth?",
    "Where do I find balance between my own needs and caring for my parents?",
    "Which family relationships are worth fighting for?",
    "How can I bond with my stepchildren authentically?",
    "How can I navigate caring for my aging parents while maintaining my life?",
    "What steps should I take to reconnect with estranged family?",
    "How can I create meaningful traditions with my chosen family?",
    "What is the family secret that needs to come to light?",
    "What does my resistance to my family's values tell me about myself?",
    "What does healthy family support actually look like for me?"
  ],
  "money": [
    "Will my financial situation ever feel stable?",
    "Am I going to be able to pay off my student loans?",
    "Will being honest about my debt ruin my relationship?",
    "Should I lend money to my family member who keeps asking?",
    "Should I prioritize passion or paycheck in my next career move?",
    "Is it wise to tell my partner about my hidden debt?",
    "Is my spending pattern a symptom of something deeper?",
    "Are my money fears based in reality or past trauma?",
    "Why does money always seem to slip through my fingers?",
    "What causes me to make impulsive purchases?",
    "When will I feel confident asking for the salary I deserve?",
    "How long will this financial stress continue?",
    "Where is my pattern of financial self-sabotage coming from?",
    "How can I break generational patterns around money?",
    "How can I set boundaries when family asks for money?",
    "What steps should I take to negotiate my salary?",
    "How can I stop spending money I don't have?",
    "Why does checking my bank account fill me with dread?",
    "What does financial security actually mean to me?",
    "What does my fear of bankruptcy reveal about my values?"
  ],
  "decisions": [
    "Will I regret this move if I take the leap?",
    "Am I going to hurt them too much if I end this friendship?",
    "Will coming out change my life for better or worse?",
    "Should I uproot my life for this opportunity?",
    "Should I let this friendship fade or officially end it?",
    "Is it wise to have children given my circumstances?",
    "Is this the right time to make this medical decision?",
    "Are my doubts about having children valid concerns or just fear?",
    "Is my desire for stability holding me back from my dreams?",
    "Why am I so afraid to reveal my true self to others?",
    "What causes my paralysis when facing big life decisions?",
    "When will I know it's time to share my truth with others?",
    "How long should I wait before making this life-changing choice?",
    "Where is my resistance to this change really coming from?",
    "Which path honors both my dreams and my need for security?",
    "How can I forgive someone who hasn't apologized?",
    "Is now the right time for this major purchase or commitment?",
    "What steps should I take to prepare for coming out?",
    "How can I make peace with changing my beliefs?",
    "What does my fear of this decision reveal about what I truly want?"
  ]
}
