{
  "positions": {
    "todays_guidance": {
      "name": "Today's Guidance",
      "description": "Your guidance for today"
    },
    "past": {
      "name": "Past",
      "description": "What has shaped this moment"
    },
    "present": {
      "name": "Present",
      "description": "Where you are now"
    },
    "future": {
      "name": "Future",
      "description": "Where this path leads"
    },
    "situation": {
      "name": "Situation",
      "description": "The nature of what you face"
    },
    "action": {
      "name": "Action",
      "description": "The approach advised"
    },
    "outcome": {
      "name": "Outcome",
      "description": "The likely result"
    },
    "challenge": {
      "name": "Challenge",
      "description": "The obstacle you face"
    },
    "above": {
      "name": "Above",
      "description": "Best possible outcome, conscious goals"
    },
    "below": {
      "name": "Below",
      "description": "Subconscious influences, hidden foundation"
    },
    "advice": {
      "name": "Advice",
      "description": "Guidance for moving forward"
    },
    "external": {
      "name": "External",
      "description": "Outside influences affecting you"
    },
    "hopes_fears": {
      "name": "Hopes/Fears",
      "description": "What you hope for or fear"
    },
    "hidden_influences": {
      "name": "Hidden Influences",
      "description": "Factors not immediately apparent"
    },
    "obstacles": {
      "name": "Obstacles",
      "description": "Challenges to overcome"
    },
    "external_influences": {
      "name": "External Influences",
      "description": "People or events affecting you"
    }
  },
  "modifiers": {
    "The Fool": {
      "upright": {
        "todays_guidance": "Today invites a leap of faith. Approach whatever arises with beginner's mind—fresh eyes, open heart. Don't overthink; trust the impulse toward something new. The day favors starting over planning.",
        "past": "You already took this leap. Something began with trust rather than certainty—that choice shaped where you now stand. The seeds of your present were planted when you stepped into the unknown.",
        "present": "You stand at a threshold now. The edge is exactly where you're meant to be. This moment asks for trust in the question, not answers. You carry everything you need.",
        "future": "A new beginning approaches. The path ahead invites fresh starts and open-hearted ventures. What's coming requires trust in the unknown. Prepare to leap.",
        "situation": "The situation calls for beginner's mind. Fresh perspective matters more than experience here. What looks like naivety may be exactly the openness required.",
        "action": "Take the leap. Act with trust rather than certainty. Overthinking will paralyze—move before you're ready. The action required is beginning, not perfecting.",
        "outcome": "This leads to new beginnings. Whatever happens, a fresh chapter opens. The outcome is a threshold, not a conclusion. One journey ends as another starts.",
        "challenge": "The leap itself blocks you. Fear of the unknown, or fear of appearing foolish, creates the obstacle. Beginner's vulnerability is what you're avoiding.",
        "above": "Your highest possibility here is pure new beginning. The best outcome involves stepping into the unknown with trust. Aim for the leap, not the landing.",
        "below": "Beneath this situation lies a deep yearning to begin again. Unconsciously, you want to wipe the slate clean and start fresh. This hidden desire shapes everything above it.",
        "advice": "Be the Fool. Trust more than you plan. Step before you're ready. The guidance here is to embrace not-knowing as a gift rather than a problem.",
        "external": "Someone or something in your environment embodies this energy—a catalyst for new beginnings, an invitation to leap. Or external circumstances are pushing you toward fresh starts.",
        "hopes_fears": "You hope for the freedom of new beginnings—and fear the vulnerability it requires. The open road both calls and terrifies. You want to leap but fear the fall.",
        "hidden_influences": "A hidden factor is the opportunity to begin again. Something not yet visible offers a fresh start. Or unconscious naivety shapes the situation more than you realize.",
        "obstacles": "The obstacle is taking the first step. Fear of beginning, of looking foolish, of not knowing enough—this blocks progress. The leap you're avoiding is the way forward.",
        "external_influences": "Forces outside your control push toward new beginnings. Others may see you as ready to leap before you feel it. The world invites fresh starts."
      },
      "reversed": {
        "todays_guidance": "Today asks you to examine blocked beginnings. Are you frozen at the edge or leaping without looking? Notice which shadow is active—fear or recklessness.",
        "past": "The Fool's shadow shaped your path—recklessness that left bruises, or paralysis that let opportunities pass. Understanding this pattern illuminates your present.",
        "present": "Right now you're caught between recklessness and paralysis. Either leaping without wisdom or frozen when movement is required. Which shadow is active?",
        "future": "Ahead lies a blocked beginning or a reckless leap. The path forward requires healing your relationship with risk—finding the ground between frozen and foolish.",
        "situation": "The situation involves false starts or fear-based inaction. Something about beginning has gone sideways. Either too much caution or not enough.",
        "action": "Don't leap blindly, but don't stay frozen either. The action needed is examining why beginning feels impossible or why you're rushing without looking.",
        "outcome": "This leads to incomplete beginnings or consequences of recklessness. The result involves learning—possibly through failure—about how to start wisely.",
        "challenge": "A broken relationship with risk blocks you. Past burns made you either too cautious or too reckless. Healthy trust in yourself is what you're missing.",
        "above": "Your best hope involves healing blocked beginnings. The highest outcome requires moving past fear without falling into recklessness. Wise beginning, not paralysis or impulsiveness.",
        "below": "Beneath this situation lies fear of beginning—or unconscious recklessness. Hidden patterns around risk and trust shape everything. Past leaps or frozen moments echo here.",
        "advice": "Examine your relationship with beginning. Why are you stuck or rushing? The guidance is neither 'just leap' nor 'stay safe' but 'understand your pattern.'",
        "external": "Outside influences reflect blocked beginnings or recklessness. Someone in your environment fears change or acts without thinking. This mirrors something in you.",
        "hopes_fears": "You fear both the leap and the staying. Recklessness terrifies; paralysis terrifies. The hope is finding the middle ground you can't quite see.",
        "hidden_influences": "A hidden factor is fear disguised as wisdom, or recklessness disguised as courage. Something not visible involves false starts or frozen potential.",
        "obstacles": "The obstacle is your wounded relationship with risk. Either you can't start or you can't stop starting over. Past experiences with beginning block the way.",
        "external_influences": "External forces reflect blocked or reckless energy. Others may be urging action you're not ready for, or their caution reinforces your paralysis."
      }
    },
    "The Magician": {
      "upright": {
        "todays_guidance": "Today you have everything needed to manifest your intentions. Focus energy, take action, trust your skills. The tools are on the table—use them.",
        "past": "You once channeled your will effectively. A time when skills, resources, and timing aligned. That manifestation, successful or not, taught you what's possible.",
        "present": "Right now you possess all necessary elements. The channel between intention and reality is open. What you focus on, you can create. Act on this.",
        "future": "Coming: a time when everything aligns for manifestation. Skills sharpen, resources appear, opportunity opens. Prepare to act with focused will.",
        "situation": "The situation calls for directed will and skillful action. All elements are present—the question is how you'll channel them. This is about manifestation.",
        "action": "Focus your intention and act with confidence. Use the skills you have. The action required is deliberate creation—channeling will into form.",
        "outcome": "This leads to manifestation of intention. What you've focused on takes form. The outcome depends on what you've been channeling your energy toward.",
        "challenge": "The challenge is focusing scattered energy. All elements exist but you're not bringing them together. Directed will is what's lacking.",
        "above": "Your highest possibility is masterful manifestation. The best outcome involves channeling all your gifts toward a clear intention. Aim for skillful creation.",
        "below": "Beneath this situation lies untapped power to create. Unconsciously you know you could manifest what you want—this potential shapes everything.",
        "advice": "Channel your energy deliberately. You have the skills—focus them. The guidance is to recognize your power and use it consciously.",
        "external": "Someone with Magician energy influences the situation—a skilled manifester, a catalyst. Or external circumstances provide all the tools you need.",
        "hopes_fears": "You hope to manifest your will fully—and fear having the power to do so. Or fear that you lack what's needed when you actually don't.",
        "hidden_influences": "A hidden factor is latent power to create. Something not visible involves untapped skill or resources waiting to be channeled.",
        "obstacles": "The obstacle is scattered focus or unused tools. Everything needed exists but isn't being directed. The blockage is in the channeling, not the capacity.",
        "external_influences": "External forces offer all the elements for manifestation. The world provides what's needed—the question is whether you'll use it."
      },
      "reversed": {
        "todays_guidance": "Today notice where energy scatters or power gets misused. Are you doubting real abilities or using skills to manipulate? Ground your intention.",
        "past": "You once scattered your power or used it poorly. Manipulation, self-deception, or wasted potential—this history shapes your current relationship with your abilities.",
        "present": "Right now energy scatters or power misdirects. Either doubting what you can do, or using skills in shadow ways. The tools exist but aren't serving well.",
        "future": "Ahead lies a need to address scattered energy or misused power. What's coming requires honest reckoning with how you channel your abilities.",
        "situation": "The situation involves scattered or misused power. Talents wasted, energy diffused, or skill serving manipulation. Something about manifestation has gone sideways.",
        "action": "Stop scattering energy or manipulating. The action needed is honest assessment of how you're using your power. Focus or come clean.",
        "outcome": "This leads to consequences of scattered focus or manipulation. The result shows what happens when power isn't channeled cleanly.",
        "challenge": "The challenge is your relationship with your own power—doubting it, scattering it, or using it to deceive. Honest self-assessment is needed.",
        "above": "Your best hope involves reclaiming and focusing your power honestly. The highest outcome requires addressing manipulation or self-doubt.",
        "below": "Beneath this situation lies fear of your own power or shadow uses of it. Unconscious manipulation or self-sabotage shapes what's visible.",
        "advice": "Examine how you use your gifts. Stop scattering or deceiving. The guidance is to get honest about your power—claim it cleanly or not at all.",
        "external": "Outside influences involve manipulation or wasted potential. Someone may be deceiving you, or external chaos scatters your focus.",
        "hopes_fears": "You fear your power—either having it or not having it. The shadow Magician in you worries about manipulation or inadequacy.",
        "hidden_influences": "A hidden factor is deception or untapped potential. Something not visible involves either manipulation at play or gifts you're not using.",
        "obstacles": "The obstacle is self-deception, manipulation, or scattered focus. The blockage isn't lacking power—it's how that power is being (mis)used.",
        "external_influences": "External forces scatter your energy or introduce deception. The world reflects your shadow relationship with power back to you."
      }
    },
    "The High Priestess": {
      "upright": {
        "todays_guidance": "Today trust intuition over logic. Listen to dreams, hunches, subtle knowing. Receptivity over action. The answers aren't in analysis—they're in stillness.",
        "past": "You once knew something without knowing how. That intuition—trusted or ignored—shaped the path to here. The inner voice spoke; what did you do with it?",
        "present": "Right now intuition offers guidance that logic can't. The conscious mind doesn't have these answers—the unconscious does. Listen inward.",
        "future": "Coming: a time when inner wisdom becomes essential. Intuition will guide where analysis fails. Prepare to trust what you can't fully explain.",
        "situation": "The situation holds hidden dimensions that only intuition can access. There's more beneath the surface than appears. Mystery is involved—honor it.",
        "action": "Go inward, not outward. The action needed is listening, not doing. Sit with the question rather than forcing answers. Let knowing emerge.",
        "outcome": "This leads to revelation of hidden truth. What was unconscious surfaces. The outcome involves finally knowing what you've sensed all along.",
        "challenge": "The challenge is trusting what you can't prove. Intuition speaks but you struggle to follow it without rational justification. The veil blocks because you won't part it.",
        "above": "Your highest possibility is deep intuitive wisdom. The best outcome involves trusting inner knowing completely. Aim for the priestess's certainty.",
        "below": "Beneath this situation lies vast unconscious knowledge. You already know more than you realize. This hidden wisdom shapes everything above it.",
        "advice": "Trust your intuition. The guidance is to honor inner knowing even when it can't be explained. Go still. Listen to what whispers.",
        "external": "Someone with deep intuitive wisdom influences the situation. Or external circumstances require tuning into what's hidden rather than obvious.",
        "hopes_fears": "You hope for clear inner knowing—and fear the mystery it requires. Trusting intuition means releasing control; that's both desired and frightening.",
        "hidden_influences": "A hidden factor is intuitive truth waiting to be acknowledged. Something not visible involves the unconscious wisdom you're not yet accessing.",
        "obstacles": "The obstacle is ignoring or overriding intuition. Inner wisdom speaks but gets dismissed for rational analysis. The mystery blocks because you won't enter it.",
        "external_influences": "External forces call you toward inner wisdom. The world asks you to access what you know beneath the surface."
      },
      "reversed": {
        "todays_guidance": "Today notice where you're disconnected from intuition or where secrets cause harm. Are you ignoring inner wisdom or is something hidden that shouldn't be?",
        "past": "You once lost connection to intuition, or secrets caused damage. That disconnection from inner knowing shaped your path. Hidden things had power because they stayed hidden.",
        "present": "Right now intuition is blocked or secrets disrupt. Either you're too rational, dismissing gut feelings, or something concealed needs surfacing.",
        "future": "Ahead lies reckoning with blocked intuition or damaging secrets. What's coming requires either reconnecting to inner wisdom or revealing what's hidden.",
        "situation": "The situation involves disconnection from intuition or secrets causing harm. Something hidden distorts things, or inner wisdom goes unheard.",
        "action": "Either reconnect to intuition or bring secrets to light. The action needed addresses whatever is blocked or hidden. Stop ignoring what you know.",
        "outcome": "This leads to consequences of ignored intuition or revealed secrets. The result shows what happens when inner wisdom goes unheeded or when hidden things surface.",
        "challenge": "The challenge is blocked intuition or harmful secrets. Either you can't access inner knowing or something concealed creates the obstacle.",
        "above": "Your best hope involves reconnecting to intuition or clearing secrets. The highest outcome requires addressing what's blocked or hidden.",
        "below": "Beneath this situation lies repressed intuition or buried secrets. Unconscious disconnection from inner wisdom shapes everything visible.",
        "advice": "Address the disconnection. Reconnect to intuition or bring hidden things to light. The guidance is to stop ignoring what you know or hiding what should be known.",
        "external": "Outside influences involve blocked intuition or hidden information. Someone may be keeping secrets, or external noise drowns out inner wisdom.",
        "hopes_fears": "You fear losing connection to inner wisdom—and fear what might surface if you truly listen. The secrets and the knowing both frighten.",
        "hidden_influences": "A hidden factor is repressed intuition or secrets affecting the situation invisibly. Something not conscious plays a larger role than you realize.",
        "obstacles": "The obstacle is disconnection from inner knowing or something deliberately concealed. The blockage involves what you can't or won't access.",
        "external_influences": "External forces block intuitive access or involve secrets. The world reflects your disconnection from inner wisdom back to you."
      }
    },
    "Death": {
      "upright": {
        "todays_guidance": "Today something ends so something else can begin. Don't resist the transformation—release what's passing. The day asks for surrender to necessary change.",
        "past": "A necessary ending shaped your journey. Something died—identity, relationship, belief, chapter—and that transformation brought you here. The old had to pass.",
        "present": "You're mid-transformation now. Something actively ends while something else prepares to be born. This moment is the chrysalis, not the butterfly yet.",
        "future": "Transformation approaches. What needs to end will end. The path ahead includes necessary death of something—prepare to release rather than grip.",
        "situation": "The situation involves fundamental transformation. Something must end for something new to live. Metamorphosis, not mere change—deep restructuring.",
        "action": "Let go. Release what's ending rather than fighting to preserve it. The action required is conscious surrender to transformation already underway.",
        "outcome": "This leads to complete transformation. What exists now will not exist in the same form. The outcome is rebirth through necessary ending.",
        "challenge": "The transformation itself is your obstacle. Resistance to necessary ending blocks progress. What you're gripping is what you need to release.",
        "above": "Your highest possibility is complete transformation. The best outcome involves fully releasing the old so the new can emerge. Aim for total metamorphosis.",
        "below": "Beneath this situation lies the truth that something must die. Unconsciously you know what needs ending—this hidden knowing shapes everything.",
        "advice": "Surrender to the transformation. Stop bargaining with the inevitable. The guidance is to release gracefully rather than be dragged through.",
        "external": "External forces demand transformation. Something or someone outside you insists on ending what's no longer viable. The environment won't let the old survive.",
        "hopes_fears": "You hope transformation brings rebirth—and fear the death it requires. The ending is both what you need and what terrifies you.",
        "hidden_influences": "A hidden factor is transformation already underway. Something not visible is ending or preparing to end. The metamorphosis has begun beneath the surface.",
        "obstacles": "The obstacle is the ending you're resisting. What blocks you is your grip on what's already dying. Transformation stalls because you won't let go.",
        "external_influences": "External forces insist on transformation. The world demands ending and rebirth, whether you feel ready or not."
      },
      "reversed": {
        "todays_guidance": "Today notice where transformation stalls. Something won't die, or you won't let it. The day asks for honest look at what you're keeping alive past its time.",
        "past": "A transformation that didn't complete shapes your present. Something should have ended but lingered. That incomplete death still haunts.",
        "present": "Right now transformation stalls. Something dying won't die, or you're blocking change that needs to happen. The chrysalis isn't dissolving.",
        "future": "Ahead lies stalled transformation or prolonged endings. What's coming involves finally completing what wouldn't finish, or continuing to stagnate.",
        "situation": "The situation involves blocked or incomplete transformation. Something should have ended but hasn't. Stagnation from resisted change.",
        "action": "Complete the ending or stop resisting it. The action needed addresses whatever transformation you've blocked. Let what's dying finally die.",
        "outcome": "This leads to consequences of blocked transformation. The result shows what happens when necessary endings don't complete—stagnation or forced eventual change.",
        "challenge": "The challenge is completing transformation you've resisted. What blocks you is the ending you keep postponing. The half-death prevents rebirth.",
        "above": "Your best hope involves finally completing the transformation. The highest outcome requires letting what should have ended finally end.",
        "below": "Beneath this situation lies fear of completing the transformation. Unconsciously you're holding onto what needs to die. This resistance shapes everything.",
        "advice": "Finish it. Let the ending complete. The guidance is to stop prolonging what should have already passed. The half-alive must become fully dead to become fully alive again.",
        "external": "Outside influences reflect stalled transformation. Someone or something in your environment models incomplete endings or blocks necessary change.",
        "hopes_fears": "You fear both the ending and the endless dying. You hope to avoid transformation—but also fear staying stuck in its incomplete form.",
        "hidden_influences": "A hidden factor is blocked transformation. Something not visible involves stalled change or resistance to necessary endings that shapes the situation.",
        "obstacles": "The obstacle is the transformation you won't complete. What blocks you is your refusal to let something finally die. Partial change stagnates.",
        "external_influences": "External forces reflect or reinforce blocked transformation. The world mirrors your resistance back to you, or actively prevents needed endings."
      }
    },
    "The Star": {
      "upright": {
        "todays_guidance": "Today brings healing and hope. Trust that renewal is possible. Pour yourself out without fearing depletion—you'll be replenished. The day invites faith.",
        "past": "Hope and healing shaped your journey. A time when renewal seemed possible, when faith was restored. That light, however brief, left its mark.",
        "present": "Right now hope is available if you'll receive it. Healing energy surrounds this moment. Renewal and faith are present—not just coming, but here.",
        "future": "Healing approaches. After darkness or upheaval, light returns. What's coming brings renewed faith, inspiration, authentic connection to meaning.",
        "situation": "The situation holds hope and potential for healing. Renewal is possible here. Despite whatever darkness preceded, light exists in this.",
        "action": "Pour yourself out in faith. Trust the process of healing. The action needed is vulnerable openness—giving without fearing depletion.",
        "outcome": "This leads to renewal and restored faith. The outcome is healing—not just surviving the dark but finding light beyond it.",
        "challenge": "The challenge is accepting hope. Healing is available but you struggle to believe in it. Cynicism or past wounds block renewal.",
        "above": "Your highest possibility is complete renewal. The best outcome involves fully embracing hope and healing. Aim for the Star's serene faith.",
        "below": "Beneath this situation lies deep need for hope and healing. Unconsciously you're seeking renewal—this hidden longing shapes everything.",
        "advice": "Trust the light. Accept healing. The guidance is to believe in renewal even when it seems fragile. Pour yourself out and trust replenishment.",
        "external": "Outside influences offer hope and healing. Someone or something in your environment carries the Star's energy—a source of renewal.",
        "hopes_fears": "You hope for healing and renewed faith—and fear it won't come, or won't last. Hope itself feels vulnerable.",
        "hidden_influences": "A hidden factor is healing already underway. Something not visible involves renewal working beneath the surface. Hope exists where you don't see it.",
        "obstacles": "The obstacle is blocked hope. What blocks you is difficulty believing in healing or receiving it. The light is there; you're not looking at it.",
        "external_influences": "External forces offer renewal and hope. The world provides healing if you'll accept it."
      },
      "reversed": {
        "todays_guidance": "Today notice where hope feels blocked. Despair, disconnection, or lost faith—name it honestly. The day asks where you've stopped believing in renewal.",
        "past": "Lost hope or blocked healing shaped your path. A time when faith collapsed or renewal felt impossible. That darkness left its mark.",
        "present": "Right now hope is hard to access. Despair, disconnection from meaning, or lost faith characterizes this moment. The light exists but you can't see it.",
        "future": "Ahead lies reckoning with lost hope. What's coming involves either finding faith again or sinking deeper into disconnection. The choice approaches.",
        "situation": "The situation involves blocked hope or lost faith. Healing available but not received. Despair or cynicism shapes the landscape.",
        "action": "Address the despair. Seek what's blocking hope. The action needed is honest acknowledgment of lost faith—not false positivity, but real reckoning.",
        "outcome": "This leads to consequences of blocked hope. The result shows what happens when healing is refused or faith collapses.",
        "challenge": "The challenge is lost hope blocking everything else. Despair or cynicism is the obstacle. What you've stopped believing in is what you need.",
        "above": "Your best hope is recovering hope. The highest outcome involves finding your way back to faith and healing. Aim for renewed belief.",
        "below": "Beneath this situation lies buried despair. Unconsciously, you've lost hope—this hidden loss of faith shapes everything visible.",
        "advice": "Acknowledge the despair, then look for light anyway. The guidance is neither denial nor wallowing—honest reckoning followed by renewed search for hope.",
        "external": "Outside influences reflect or reinforce lost hope. Someone or something in your environment models despair or blocks access to healing.",
        "hopes_fears": "You fear hope is lost forever—and fear finding it only to lose it again. Faith feels too dangerous to reach for.",
        "hidden_influences": "A hidden factor is despair affecting the situation. Something not visible involves lost faith or blocked healing shaping outcomes.",
        "obstacles": "The obstacle is despair itself. What blocks you is lost hope or inability to believe in renewal. The light exists; you've turned away from it.",
        "external_influences": "External forces reflect or reinforce disconnection from hope. The world mirrors your despair or actively blocks healing."
      }
    },
    "The Empress": {
      "upright": {
        "todays_guidance": "Today nurture and be nurtured. Create, grow, receive pleasure. The day invites abundance through allowing rather than forcing. Let things bloom.",
        "past": "Abundance and nurturing shaped your path. A time of growth, creativity, fertility in some form. That generative energy brought you here.",
        "present": "Right now creative abundance is available. Nurturing energy surrounds this moment. Growth happens through receiving and allowing, not pushing.",
        "future": "Fertility and abundance approach. What's coming involves growth, creativity, pleasure. Prepare to receive and nurture what's given.",
        "situation": "The situation calls for nurturing energy. Creative abundance is possible here. Growth through care, not force. The mother principle at work.",
        "action": "Nurture what needs nurturing. Create, receive, allow growth. The action required is generative care—tending rather than forcing.",
        "outcome": "This leads to abundance and creative fruition. What's been nurtured bears fruit. The outcome is growth realized.",
        "challenge": "The challenge is receiving or nurturing. Creative blocks, depleted care, inability to allow abundance. Something about fertility or nurturing is stuck.",
        "above": "Your highest possibility is abundant creativity. The best outcome involves full nurturing and growth. Aim for the Empress's generative overflow.",
        "below": "Beneath this situation lies deep need to nurture or be nurtured. Unconscious creativity or mother-hunger shapes everything above.",
        "advice": "Nurture. Create. Receive. The guidance is to allow abundance rather than chase it. Tend your garden; it will grow.",
        "external": "Outside influences offer nurturing or creative energy. Someone embodies the Empress—abundant, generative, caring. Or circumstances invite growth.",
        "hopes_fears": "You hope for abundance and creative fertility—and fear you can't receive or sustain it. Nurturing feels both needed and daunting.",
        "hidden_influences": "A hidden factor is creative potential or nurturing need. Something not visible involves fertility, growth, or care shaping the situation.",
        "obstacles": "The obstacle involves blocked nurturing or creativity. What blocks you is inability to receive, create, or care. The abundance is there; access is stuck.",
        "external_influences": "External forces offer abundance and growth. The world provides nurturing energy if you'll receive it."
      },
      "reversed": {
        "todays_guidance": "Today notice where nurturing is blocked or excessive. Smothering, creative blocks, depleted care. The day asks what's wrong with growth and receiving.",
        "past": "Blocked creativity or wounded nurturing shaped your path. A time when growth stalled, care depleted, or love smothered. That wound echoes.",
        "present": "Right now nurturing energy is stuck. Either giving too much, receiving too little, or creativity blocked. The growth principle isn't flowing.",
        "future": "Ahead lies reckoning with blocked abundance. What's coming involves addressing creative blocks, depleted care, or smothering patterns.",
        "situation": "The situation involves wounded nurturing or blocked creativity. Something about growth, care, or receiving has gone wrong.",
        "action": "Address the blockage. Stop smothering or start nurturing. The action needed confronts whatever has stalled growth or depleted care.",
        "outcome": "This leads to consequences of blocked nurturing. The result shows what happens when creativity stalls or care wounds.",
        "challenge": "The challenge is wounded abundance. Creative blocks, depleted giving, smothering love. Something about the mother principle is the obstacle.",
        "above": "Your best hope involves healing nurturing wounds. The highest outcome requires addressing creative blocks or care patterns.",
        "below": "Beneath this situation lies wounded nurturing. Unconscious creative blocks or mother-wounds shape everything visible.",
        "advice": "Address what's blocked. Stop over-giving or start receiving. The guidance is to find healthy flow in nurturing—neither starved nor smothered.",
        "external": "Outside influences reflect blocked nurturing. Someone models creative blocks, depletion, or smothering. The environment stifles or starves growth.",
        "hopes_fears": "You fear creative depletion or smothering love. The wound around nurturing—too much or too little—frightens.",
        "hidden_influences": "A hidden factor is blocked creativity or nurturing wounds. Something not visible involves stalled growth or care patterns.",
        "obstacles": "The obstacle is wounded nurturing. What blocks you involves creative blocks, depleted care, or excessive control over growth.",
        "external_influences": "External forces reflect blocked abundance. The world mirrors creative stagnation or nurturing wounds back to you."
      }
    },
    "The Emperor": {
      "upright": {
        "todays_guidance": "Today establish structure and take command. Build foundations, set boundaries, claim authority. The day calls for the father principle—protect and order.",
        "past": "Structure and authority shaped your path. A time when foundations were built, order established, or a father figure influenced you. That stability brought you here.",
        "present": "Right now structure is needed. Authority must be claimed or acknowledged. Boundaries require setting. This moment calls for order and command.",
        "future": "Structure and stability approach. What's coming involves building foundations, taking authority, establishing order. Prepare to lead.",
        "situation": "The situation calls for structure and authority. Order is needed here. The question is whether you'll establish it or submit to another's.",
        "action": "Take command. Build structure. Set boundaries. The action required is assuming authority and creating order. Lead, don't follow.",
        "outcome": "This leads to established structure. Foundations built, authority claimed, order created. The outcome is stability through discipline.",
        "challenge": "The challenge is claiming or handling authority. Either you can't take command or you're facing someone else's. Structure is the issue.",
        "above": "Your highest possibility is masterful authority. The best outcome involves building lasting foundations and leading well. Aim for the Emperor's stable command.",
        "below": "Beneath this situation lies need for structure or father-energy. Unconscious patterns around authority shape everything above.",
        "advice": "Take command. Build foundations. The guidance is to claim your authority and create the structure you need. Be the Emperor, not the subject.",
        "external": "Outside influences involve authority or structure. A father figure, boss, or institution affects things. Or circumstances demand you take charge.",
        "hopes_fears": "You hope for stable authority—and fear it (yours or others'). Power, control, and structure feel both needed and threatening.",
        "hidden_influences": "A hidden factor involves authority or structure. Something not visible relates to father-energy, control, or foundations.",
        "obstacles": "The obstacle involves authority. Either you can't claim yours, or another's blocks you. Structure is stuck or imposed.",
        "external_influences": "External forces involve authority and structure. The world demands order or imposes someone else's control."
      },
      "reversed": {
        "todays_guidance": "Today notice where authority is abused or absent. Tyranny, rigidity, or lack of structure. The day asks what's wrong with power and control.",
        "past": "Wounded authority shaped your path. A time when power was abused, structure failed, or father-energy wounded you. That pattern echoes.",
        "present": "Right now authority is problematic. Either tyrannical, rigid, absent, or you can't claim yours. Structure is broken or excessive.",
        "future": "Ahead lies reckoning with wounded authority. What's coming involves confronting abuse of power, absent leadership, or structural failures.",
        "situation": "The situation involves broken authority. Power abused, structure too rigid or absent, leadership failing. Something about the father principle is wrong.",
        "action": "Address the authority wound. Confront tyranny or claim power you've avoided. The action needed fixes what's wrong with control and structure.",
        "outcome": "This leads to consequences of broken authority. The result shows what happens when power corrupts or structure fails.",
        "challenge": "The challenge is wounded power. Tyranny, rigidity, absent authority—something about control and structure is the obstacle.",
        "above": "Your best hope involves healing authority wounds. The highest outcome requires healthy relationship with power and structure.",
        "below": "Beneath this situation lies wounded authority. Unconscious father-wounds or control issues shape everything visible.",
        "advice": "Address the power wound. Neither tyrannize nor abdicate. The guidance is to find healthy authority—firm but not rigid, present but not dominating.",
        "external": "Outside influences reflect wounded authority. A tyrannical figure, absent leader, or broken institution affects the situation.",
        "hopes_fears": "You fear abuse of power—yours or others'. Authority feels dangerous, either its excess or its absence.",
        "hidden_influences": "A hidden factor is broken authority. Something not visible involves power abuse, absent leadership, or structural failure.",
        "obstacles": "The obstacle is wounded authority. What blocks you involves tyranny, rigidity, or inability to take necessary control.",
        "external_influences": "External forces reflect broken power. The world imposes tyranny or reflects absent authority back to you."
      }
    },
    "The Hierophant": {
      "upright": {
        "todays_guidance": "Today consider tradition and established paths. Seek teachers, honor institutions, follow proven methods. The day invites learning through structure.",
        "past": "Tradition and teaching shaped your path. A time when established methods guided you, when you learned from those who came before. That foundation influences now.",
        "present": "Right now tradition has something to offer. Established wisdom, formal learning, or proven paths are relevant. Consider what's been handed down.",
        "future": "Teaching and tradition approach. What's coming involves learning, mentorship, or established institutions. Prepare to receive structured wisdom.",
        "situation": "The situation calls for traditional approach. Established methods, proven paths, institutional wisdom. Conformity may serve here.",
        "action": "Follow the tradition. Seek teaching. Use proven methods. The action required works within established structures rather than against them.",
        "outcome": "This leads through traditional paths. The outcome involves institutional recognition, formal learning completed, or established methods succeeding.",
        "challenge": "The challenge involves tradition. Either it constrains you or you're resisting what it offers. Conformity and institution are the issue.",
        "above": "Your highest possibility is traditional wisdom mastered. The best outcome involves learning fully from what's been established. Aim for the Hierophant's deep knowledge.",
        "below": "Beneath this situation lies relationship with tradition. Unconscious conformity or rebellion against it shapes everything above.",
        "advice": "Honor what's been proven. Seek teaching. The guidance is to learn from tradition before transcending it. The old ways have value.",
        "external": "Outside influences involve tradition or institution. A teacher, mentor, or formal structure affects things. Established paths are presented.",
        "hopes_fears": "You hope for guidance and proven paths—and fear conformity's cost. Tradition feels both safe and constraining.",
        "hidden_influences": "A hidden factor involves tradition. Something not visible relates to institutional influence, inherited beliefs, or conventional expectations.",
        "obstacles": "The obstacle involves tradition. Either it blocks you or your resistance to it does. Conformity is stuck.",
        "external_influences": "External forces involve tradition and institution. The world presents established paths and conventional expectations."
      },
      "reversed": {
        "todays_guidance": "Today question tradition. Challenge conventions, forge your own path, break from what's been handed down. The day invites spiritual independence.",
        "past": "Breaking from tradition shaped your path. A time when you rejected conventional paths, challenged institutions, or forged your own way. That independence influences now.",
        "present": "Right now tradition doesn't serve. Conventions need challenging, your own path needs forging. Established methods fail or constrain.",
        "future": "Independence from tradition approaches. What's coming involves breaking from convention, challenging institutions, or finding your own spiritual path.",
        "situation": "The situation calls for questioning tradition. Established methods fail here. Personal truth diverges from received wisdom.",
        "action": "Break from convention. Forge your own path. The action required questions what's been handed down and finds your own answer.",
        "outcome": "This leads away from traditional paths. The outcome involves breaking from institution, rejecting convention, or finding personal truth outside established channels.",
        "challenge": "The challenge is breaking from tradition. Either you can't leave convention behind or you've broken too far from grounding. Independence is the issue.",
        "above": "Your highest possibility is spiritual independence. The best outcome involves finding your own truth beyond received doctrine.",
        "below": "Beneath this situation lies rebellion against tradition. Unconscious rejection of convention or unexamined assumptions shapes everything.",
        "advice": "Question the tradition. Forge your own path. The guidance is to find your truth beyond what's been handed down. Conventions may not apply.",
        "external": "Outside influences challenge tradition. Someone models unconventionality or circumstances force breaking from established paths.",
        "hopes_fears": "You hope for freedom from convention—and fear losing the ground tradition provides. Independence and belonging both matter.",
        "hidden_influences": "A hidden factor involves rejected tradition. Something not visible relates to breaking from convention or unexamined assumptions.",
        "obstacles": "The obstacle involves tradition's shadow. Either convention constrains inappropriately or rootless independence destabilizes.",
        "external_influences": "External forces challenge tradition. The world invites breaking from convention or reflects your rebellion back to you."
      }
    },
    "The Lovers": {
      "upright": {
        "todays_guidance": "Today involves meaningful choice or partnership. Align action with values. Union, harmony, and decisions that define you. Choose what you truly love.",
        "past": "A meaningful choice or union shaped your path. A time when partnership mattered or a decision revealed your values. That choice brought you here.",
        "present": "Right now meaningful choice or partnership is central. Values alignment matters. This moment asks what you truly love and whether you'll choose it.",
        "future": "Union or significant choice approaches. What's coming involves partnership, values alignment, or decisions that reveal who you are.",
        "situation": "The situation involves choice and values. Partnership may be relevant. What you choose here reveals what you truly love.",
        "action": "Choose what aligns with your values. Honor the partnership. The action required makes the choice that reflects who you really are.",
        "outcome": "This leads to union or values expressed. The outcome involves partnership realized or choice revealing your truth.",
        "challenge": "The challenge is meaningful choice. Either you can't decide or the choice conflicts with your values. Partnership or values alignment is stuck.",
        "above": "Your highest possibility is perfect union or values alignment. The best outcome involves love and choice harmonized. Aim for true partnership.",
        "below": "Beneath this situation lies deep longing for union or values clarity. Unconscious desires around love and choice shape everything.",
        "advice": "Choose what you love. Honor your values. The guidance is to align action with what truly matters. The right choice reflects who you are.",
        "external": "Outside influences involve partnership or choice. A significant other or situation forces values clarification. Love enters the picture.",
        "hopes_fears": "You hope for true love and values alignment—and fear choosing wrong or losing union. The choice feels momentous.",
        "hidden_influences": "A hidden factor involves love or values. Something not visible relates to partnership, attraction, or choices reflecting identity.",
        "obstacles": "The obstacle involves choice or union. Either you can't choose, values conflict, or partnership is blocked. Love is stuck.",
        "external_influences": "External forces involve partnership and choice. The world presents options and relationships that clarify values."
      },
      "reversed": {
        "todays_guidance": "Today notice disharmony in values or relationship. Misalignment, difficult choices, inner conflict. The day asks where love or choice has fractured.",
        "past": "Disharmony or wrong choice shaped your path. A time when values conflicted, partnership broke, or you chose against your heart. That wound echoes.",
        "present": "Right now values or partnership are misaligned. Disharmony in relationship or inner conflict about choice. Something about union is fractured.",
        "future": "Ahead lies reckoning with misalignment. What's coming involves addressing values conflicts, relationship disharmony, or choices that went wrong.",
        "situation": "The situation involves broken harmony. Values conflict, partnership struggles, or choice has gone wrong. Something about love is fractured.",
        "action": "Address the disharmony. Realign values or relationship. The action needed fixes what's broken in love or choice.",
        "outcome": "This leads to consequences of misalignment. The result shows what happens when values conflict or love fractures.",
        "challenge": "The challenge is disharmony. Values conflict, partnership struggles, or inner division. Something about choice and love is the obstacle.",
        "above": "Your best hope involves realigning values or healing partnership. The highest outcome requires addressing what's fractured in love or choice.",
        "below": "Beneath this situation lies values conflict or love wound. Unconscious disharmony shapes everything visible.",
        "advice": "Address the misalignment. Heal the disharmony. The guidance is to realign with true values and address what's wrong in love.",
        "external": "Outside influences reflect disharmony. Relationship struggles or values conflicts in environment mirror inner division.",
        "hopes_fears": "You fear ongoing disharmony—values never aligning, love never working. The fracture feels permanent.",
        "hidden_influences": "A hidden factor is values conflict or love wound. Something not visible involves disharmony shaping the situation.",
        "obstacles": "The obstacle is misalignment. What blocks you involves values conflict, broken partnership, or inability to choose from heart.",
        "external_influences": "External forces reflect disharmony. The world presents relationship struggles or values conflicts."
      }
    },
    "The Chariot": {
      "upright": {
        "todays_guidance": "Today move forward with will and determination. Harness opposing forces, take control, charge ahead. The day calls for victory through focused drive.",
        "past": "Willpower and drive shaped your path. A time when you moved forward through sheer determination. That victory or that charge brought you here.",
        "present": "Right now forward movement is possible through will. Opposing forces can be harnessed. Victory is available if you take the reins.",
        "future": "Victory and forward movement approach. What's coming requires willpower and focused drive. Prepare to charge ahead.",
        "situation": "The situation calls for determined action. Forward movement through will. Opposing forces need harnessing. Victory is possible through drive.",
        "action": "Charge forward. Take the reins. The action required is willful movement—don't hesitate, don't second-guess. Move with determination.",
        "outcome": "This leads to victory through will. Forward movement achieved. The outcome is what happens when you refuse to be stopped.",
        "challenge": "The challenge is moving forward. Something blocks your drive or scatters your will. Victory requires focus you're struggling to achieve.",
        "above": "Your highest possibility is triumphant forward movement. The best outcome involves complete victory through focused will. Aim for the Chariot's unstoppable drive.",
        "below": "Beneath this situation lies drive and will. Unconscious ambition or need for control shapes everything above.",
        "advice": "Take control and move. The guidance is to harness all forces toward your goal. Victory comes through will, not waiting.",
        "external": "Outside influences offer momentum or challenge requiring drive. Circumstances demand forward movement. The race is on.",
        "hopes_fears": "You hope for victory and forward movement—and fear losing control or being stopped. Momentum feels both exciting and precarious.",
        "hidden_influences": "A hidden factor involves willpower or momentum. Something not visible relates to drive, control, or forward movement.",
        "obstacles": "The obstacle blocks forward momentum. What stops you requires greater will or better harnessing of forces. The charge is stuck.",
        "external_influences": "External forces demand forward movement. The world requires willpower and drive. Victory is available for those who move."
      },
      "reversed": {
        "todays_guidance": "Today notice scattered will or blocked movement. Lack of direction, aggression without purpose, forces pulling apart. Where has momentum stalled?",
        "past": "Scattered will or blocked movement shaped your path. A time when drive went nowhere, aggression misfired, or you couldn't move forward. That stalling echoes.",
        "present": "Right now momentum is blocked. Will scatters, direction unclear, forces won't align. Forward movement is stuck.",
        "future": "Ahead lies reckoning with blocked momentum. What's coming involves addressing scattered will or regaining direction.",
        "situation": "The situation involves blocked forward movement. Will scatters, direction lost, forces pull apart. Something about drive has stalled.",
        "action": "Address the stalling. Find direction or stop forcing. The action needed examines why momentum is blocked.",
        "outcome": "This leads to consequences of scattered will. The result shows what happens when drive has no direction or force without purpose.",
        "challenge": "The challenge is blocked momentum. Scattered will, lost direction, or forces that won't align. Forward movement is the obstacle.",
        "above": "Your best hope involves regaining direction. The highest outcome requires focusing scattered will or releasing forced control.",
        "below": "Beneath this situation lies scattered drive. Unconscious conflicts about direction or control shape everything visible.",
        "advice": "Address the stalling. Find direction or release force. The guidance is to examine what's blocking momentum before pushing harder.",
        "external": "Outside influences reflect blocked momentum. Chaos scatters your focus or obstacles stop your charge.",
        "hopes_fears": "You fear permanent stalling—momentum never returning, will forever scattered. Being stopped feels like failure.",
        "hidden_influences": "A hidden factor is blocked direction or scattered will. Something not visible stalls momentum.",
        "obstacles": "The obstacle is the stalling itself. What blocks you is scattered will, lost direction, or forces that won't align.",
        "external_influences": "External forces block or scatter momentum. The world presents obstacles or reflects your lost direction."
      }
    },
    "Strength": {
      "upright": {
        "todays_guidance": "Today use gentle power over force. Patience, compassion, quiet courage. The day calls for inner strength—mastering instinct through love, not domination.",
        "past": "Gentle strength shaped your path. A time when patience and compassion achieved what force couldn't. That soft power brought you here.",
        "present": "Right now gentle strength is needed. Patience over force, compassion over control. Inner courage available if you access it.",
        "future": "Gentle mastery approaches. What's coming requires patience, compassion, and inner strength. Prepare to tame rather than dominate.",
        "situation": "The situation calls for soft power. Force won't work here. Patience, compassion, and gentle courage are what's needed.",
        "action": "Use gentle strength. Tame through love, not force. The action required is patience and compassion, not domination.",
        "outcome": "This leads to gentle victory. What couldn't be forced is tamed through love. The outcome is mastery through patience.",
        "challenge": "The challenge is accessing inner strength. Force tempts but won't work. Patience and compassion are what you're struggling to sustain.",
        "above": "Your highest possibility is gentle mastery. The best outcome involves complete patience and compassionate power. Aim for Strength's quiet courage.",
        "below": "Beneath this situation lies inner fortitude. Unconscious courage or the lion within shapes everything above.",
        "advice": "Be gentle and strong. The guidance is to use patience and compassion. The lion is tamed through love, not chains.",
        "external": "Outside influences call for gentle power. Someone embodies patient strength or circumstances require soft courage.",
        "hopes_fears": "You hope for inner courage and gentle mastery—and fear you lack the patience or that softness means weakness.",
        "hidden_influences": "A hidden factor involves inner strength. Something not visible relates to courage, patience, or the taming of instinct.",
        "obstacles": "The obstacle requires gentle strength. What blocks you can't be forced. Patience and compassion are what's needed.",
        "external_influences": "External forces call for soft power. The world requires patience and inner courage."
      },
      "reversed": {
        "todays_guidance": "Today notice where strength fails. Self-doubt, raw emotion overpowering reason, or force misused. Where has gentle power collapsed?",
        "past": "Failed strength shaped your path. A time when patience broke, force was misused, or inner courage collapsed. That weakness echoes.",
        "present": "Right now inner strength is struggling. Self-doubt, overwhelming emotion, or misused power. Gentle mastery is failing.",
        "future": "Ahead lies reckoning with failed strength. What's coming requires addressing self-doubt or restoring gentle power.",
        "situation": "The situation involves collapsed strength. Self-doubt, overwhelming instinct, or force where patience was needed. Something about courage has failed.",
        "action": "Address the weakness. Restore patience or release force. The action needed rebuilds inner strength or stops misusing power.",
        "outcome": "This leads to consequences of failed strength. The result shows what happens when patience breaks or courage collapses.",
        "challenge": "The challenge is failed inner strength. Self-doubt, overwhelming emotion, or force without love. Gentle power is the obstacle.",
        "above": "Your best hope involves restoring inner strength. The highest outcome requires rebuilding patience, compassion, and quiet courage.",
        "below": "Beneath this situation lies self-doubt or overwhelm. Unconscious weakness or the untamed lion shapes everything.",
        "advice": "Address the weakness. Rebuild patience, restore faith in yourself. The guidance is to find gentle power again—neither collapsed nor forcing.",
        "external": "Outside influences reflect failed strength. Someone models weakness or force, or circumstances overwhelm patience.",
        "hopes_fears": "You fear ongoing weakness—courage never returning, always overwhelmed. The inner lion feels untamable.",
        "hidden_influences": "A hidden factor is collapsed strength. Something not visible involves self-doubt or overwhelm shaping outcomes.",
        "obstacles": "The obstacle is failed inner strength. What blocks you is self-doubt, overwhelming emotion, or misused force.",
        "external_influences": "External forces reflect or test inner strength. The world presents challenges that overwhelm gentle power."
      }
    },
    "The Hermit": {
      "upright": {
        "todays_guidance": "Today go inward. Solitude, reflection, soul-searching. The day calls for withdrawal to find inner truth. Seek wisdom in silence.",
        "past": "Solitude and reflection shaped your path. A time of withdrawal, inner searching, or guidance from within. That wisdom-seeking brought you here.",
        "present": "Right now solitude is needed. Withdrawal for reflection, inner guidance sought. This moment calls for going inward.",
        "future": "Solitude and wisdom approach. What's coming requires withdrawal, reflection, or seeking inner guidance. Prepare to go within.",
        "situation": "The situation calls for solitude. Reflection, inner guidance, withdrawal from noise. Wisdom is found in stillness here.",
        "action": "Withdraw and reflect. Go inward. The action required is solitude for wisdom—stepping back from the world to hear inner truth.",
        "outcome": "This leads to wisdom through solitude. What was sought in stillness is found. The outcome is inner truth revealed.",
        "challenge": "The challenge is going inward. Solitude feels difficult or you're avoiding reflection. Inner wisdom is blocked.",
        "above": "Your highest possibility is deep inner wisdom. The best outcome involves full solitary reflection revealing truth. Aim for the Hermit's illumination.",
        "below": "Beneath this situation lies need for solitude. Unconscious longing for withdrawal or inner guidance shapes everything.",
        "advice": "Go within. Seek solitude. The guidance is to withdraw and reflect. The answer is found in silence, not noise.",
        "external": "Outside influences support withdrawal. A wise guide appears, or circumstances demand solitary reflection.",
        "hopes_fears": "You hope for inner wisdom—and fear the solitude it requires. Going within feels both necessary and lonely.",
        "hidden_influences": "A hidden factor involves inner wisdom. Something not visible relates to solitary truth or guidance from within.",
        "obstacles": "The obstacle blocks solitude. What prevents you from going inward must be addressed. Reflection is needed but not happening.",
        "external_influences": "External forces call for withdrawal. The world supports solitude and inner seeking."
      },
      "reversed": {
        "todays_guidance": "Today notice isolation or avoiding reflection. Loneliness, withdrawal gone wrong, or refusing the inner journey. Where has solitude become exile?",
        "past": "Isolation or avoided reflection shaped your path. A time when solitude became loneliness or inner wisdom was refused. That avoidance echoes.",
        "present": "Right now solitude has gone wrong. Either isolation has become exile or you're refusing needed reflection. Inner wisdom is blocked.",
        "future": "Ahead lies reckoning with isolation or avoided wisdom. What's coming involves addressing loneliness or re-engaging after too much withdrawal.",
        "situation": "The situation involves problematic solitude. Either too much isolation or too little reflection. Something about going within has gone wrong.",
        "action": "Address the isolation. Either re-engage or finally do the reflection you've avoided. The action needed fixes solitude's shadow.",
        "outcome": "This leads to consequences of isolation or avoided wisdom. The result shows what happens when solitude becomes exile or reflection is refused.",
        "challenge": "The challenge is solitude's shadow. Loneliness, avoidance of reflection, or withdrawal that's lasted too long. Going within is stuck.",
        "above": "Your best hope involves healing isolation. The highest outcome requires either re-engaging or finally facing the inner work avoided.",
        "below": "Beneath this situation lies isolation or avoidance. Unconscious loneliness or refusal to reflect shapes everything visible.",
        "advice": "Address the shadow. Either emerge from isolation or start the reflection you've avoided. The guidance is to find healthy solitude—neither exile nor avoidance.",
        "external": "Outside influences reflect isolation. Loneliness in environment or pressure to finally face inner work.",
        "hopes_fears": "You fear permanent isolation—exile rather than solitude. Or you fear the reflection that solitude would require.",
        "hidden_influences": "A hidden factor is loneliness or avoidance. Something not visible involves isolation shaping outcomes or reflection refused.",
        "obstacles": "The obstacle is solitude's shadow. What blocks you is isolation gone too far or inner work you won't do.",
        "external_influences": "External forces reflect isolation. The world mirrors your loneliness or avoidance back to you."
      }
    },
    "Wheel of Fortune": {
      "upright": {
        "todays_guidance": "Today the wheel turns. Change is coming—up or down, in or out. Accept the cycle. What rises will fall; what falls will rise. Trust the turning.",
        "past": "A turning point shaped your path. The wheel moved—luck changed, circumstances shifted. That turning brought you here.",
        "present": "Right now change is happening. The wheel turns. This moment is a turning point—circumstances shifting, fate in motion.",
        "future": "Change approaches. The wheel will turn. What's coming involves shifting circumstances, luck changing, the cycle moving.",
        "situation": "The situation involves the turning wheel. Things are changing—destiny, karma, luck in motion. Nothing stays fixed.",
        "action": "Accept the turn. Move with the wheel. The action required is flexibility with fate—not fighting the cycle but riding it.",
        "outcome": "This leads to changed circumstances. The wheel turns and where you land depends on the larger cycle. The outcome is motion.",
        "challenge": "The challenge is the wheel itself. Change you didn't choose, luck shifting. Fate is the obstacle—and the opportunity.",
        "above": "Your highest possibility is favorable turning. The best outcome involves the wheel moving in your direction. Aim to ride the upswing.",
        "below": "Beneath this situation lies fate and karma. Unconscious patterns in the larger cycle shape everything above.",
        "advice": "Accept the turn. The guidance is to move with the wheel rather than against it. Trust that what turns down will turn up again.",
        "external": "Outside influences involve fate and change. Luck shifts, circumstances beyond control move. The wheel turns externally.",
        "hopes_fears": "You hope the wheel turns favorably—and fear it won't. Change feels both exciting and uncontrollable.",
        "hidden_influences": "A hidden factor is fate. Something not visible involves the larger cycle, karma, or luck shaping outcomes.",
        "obstacles": "The obstacle is the wheel's position. What blocks you is where you are in the cycle. Trust it will turn.",
        "external_influences": "External forces involve fate and cycles. The world turns regardless of your preferences."
      },
      "reversed": {
        "todays_guidance": "Today notice where you're stuck in the cycle or fighting change. Resistance to fate, bad luck, the wheel jammed. Where has change stalled?",
        "past": "Resistance to change or bad luck shaped your path. A time when the wheel seemed stuck or fortune was down. That struggle echoes.",
        "present": "Right now the wheel is stuck or you're fighting it. Resisting inevitable change, experiencing downturn, or feeling trapped in the cycle.",
        "future": "Ahead lies reckoning with blocked change. What's coming involves either the wheel finally moving or continued stagnation.",
        "situation": "The situation involves stuck fate. The wheel jammed, resistance to change, or downturn in progress. Something about the cycle is blocked.",
        "action": "Stop fighting the wheel. Address resistance to change. The action needed is releasing the jam, not forcing the turn.",
        "outcome": "This leads to consequences of stuck change. The result shows what happens when the cycle is resisted or fortune stays down.",
        "challenge": "The challenge is blocked change or downturn. The wheel is stuck or you're fighting it. Fate is the obstacle.",
        "above": "Your best hope involves the wheel moving again. The highest outcome requires releasing resistance or waiting for the turn.",
        "below": "Beneath this situation lies resistance to change. Unconscious fighting with fate shapes everything visible.",
        "advice": "Stop resisting. The guidance is to release the fight with fate. The wheel will turn when you stop jamming it.",
        "external": "Outside influences reflect stuck change. Bad luck or circumstances blocking the natural cycle.",
        "hopes_fears": "You fear the wheel will never turn—stuck forever in downturn. Change feels impossible.",
        "hidden_influences": "A hidden factor is blocked fate. Something not visible involves resistance to change or karma stalled.",
        "obstacles": "The obstacle is the stuck wheel. What blocks you is resistance to change or downturn that won't lift.",
        "external_influences": "External forces block or slow the cycle. The world reflects stuck change or downturn."
      }
    },
    "Justice": {
      "upright": {
        "todays_guidance": "Today act with integrity. Truth, fairness, and cause-effect are in play. The day calls for honest accountability and balanced judgment.",
        "past": "Justice shaped your path. A time when truth mattered, karma balanced, or you faced consequences—fair or not. That reckoning brought you here.",
        "present": "Right now truth and fairness are central. Cause and effect operate. This moment asks for integrity and honest accounting.",
        "future": "Justice approaches. What's coming involves truth revealed, karma balancing, or consequences arriving. Prepare for fair reckoning.",
        "situation": "The situation involves truth and balance. Fairness matters here. Consequences connect to causes. Justice is at work.",
        "action": "Act with integrity. Tell the truth. Accept responsibility. The action required is honest, fair, and accountable.",
        "outcome": "This leads to just outcomes. Truth revealed, karma balanced, fairness restored. The outcome reflects what was put in.",
        "challenge": "The challenge is fairness or truth. Either you face unjust circumstances or must confront your own accountability. Balance is the issue.",
        "above": "Your highest possibility is true justice. The best outcome involves complete fairness and truth. Aim for balanced reckoning.",
        "below": "Beneath this situation lies karma and cause-effect. Unconscious patterns of action and consequence shape everything.",
        "advice": "Be fair. Be honest. The guidance is to act with integrity and accept just consequences. Truth serves even when it's hard.",
        "external": "Outside influences involve justice. Legal matters, authority figures, or karmic circumstances. Fairness is externally demanded.",
        "hopes_fears": "You hope for fair treatment—and fear judgment or consequences. Justice feels both desired and threatening.",
        "hidden_influences": "A hidden factor involves truth or karma. Something not visible relates to causes and consequences operating.",
        "obstacles": "The obstacle involves injustice or accountability. Either unfairness blocks you or your own integrity is the issue.",
        "external_influences": "External forces involve fairness and truth. The world presents consequences and demands integrity."
      },
      "reversed": {
        "todays_guidance": "Today notice unfairness or avoided accountability. Dishonesty, injustice, or consequences dodged. Where is truth being evaded?",
        "past": "Injustice or dishonesty shaped your path. A time when fairness failed, accountability was avoided, or truth was hidden. That imbalance echoes.",
        "present": "Right now justice is failing. Unfairness operates, truth is hidden, or accountability is being dodged. Balance is off.",
        "future": "Ahead lies reckoning with injustice. What's coming involves either facing avoided consequences or addressing unfair treatment.",
        "situation": "The situation involves broken justice. Unfairness, dishonesty, or dodged accountability. Something about truth and balance is wrong.",
        "action": "Address the imbalance. Face accountability or fight injustice. The action needed restores truth and fairness.",
        "outcome": "This leads to consequences of injustice. The result shows what happens when truth is hidden or fairness fails.",
        "challenge": "The challenge is broken justice. Unfairness, dishonesty, or avoided accountability. Balance is the obstacle.",
        "above": "Your best hope involves restoring fairness. The highest outcome requires truth told and accountability accepted.",
        "below": "Beneath this situation lies hidden dishonesty or avoided consequences. Unconscious injustice shapes everything visible.",
        "advice": "Face the truth. Restore the balance. The guidance is to address unfairness or accept accountability you've avoided.",
        "external": "Outside influences involve injustice. Unfair treatment, corrupt systems, or consequences wrongly avoided.",
        "hopes_fears": "You fear ongoing injustice—fairness never restored, truth never told. Or you fear consequences finally arriving.",
        "hidden_influences": "A hidden factor is dishonesty or dodged consequences. Something not visible involves broken justice shaping outcomes.",
        "obstacles": "The obstacle is injustice. What blocks you involves unfairness, dishonesty, or avoided accountability.",
        "external_influences": "External forces involve broken fairness. The world presents injustice or demands you face what you've avoided."
      }
    },
    "The Hanged Man": {
      "upright": {
        "todays_guidance": "Today surrender to gain wisdom. Pause, let go, see differently. The day calls for voluntary suspension—sacrifice of position for perspective.",
        "past": "Surrender shaped your path. A time when you paused, let go, or saw from a new angle. That willing suspension brought insight.",
        "present": "Right now pause is needed. Surrender, see differently, let go of control. This moment calls for the Hanged Man's willing suspension.",
        "future": "Surrender approaches. What's coming requires letting go, pausing, or gaining new perspective. Prepare to hang willingly.",
        "situation": "The situation calls for surrender. Pause, release control, see from a new angle. What looks like stalling is actually incubation.",
        "action": "Surrender. Pause. Let go. The action required is willing suspension—stopping to see differently rather than pushing forward.",
        "outcome": "This leads to wisdom through surrender. What was sacrificed in position is gained in perspective. The outcome is seeing differently.",
        "challenge": "The challenge is letting go. You can't or won't surrender. Control, forward movement, or position feels impossible to release.",
        "above": "Your highest possibility is wisdom through surrender. The best outcome involves complete letting go for new perspective. Aim for the Hanged Man's illumination.",
        "below": "Beneath this situation lies need to let go. Unconscious resistance to surrender shapes everything above.",
        "advice": "Surrender. Pause. The guidance is to stop fighting and let yourself hang. The perspective gained is worth the position sacrificed.",
        "external": "Outside influences demand pause. Circumstances force stopping, or someone models willing surrender.",
        "hopes_fears": "You hope surrender brings wisdom—and fear what you must release to get it. Letting go feels both necessary and terrifying.",
        "hidden_influences": "A hidden factor is the need to surrender. Something not visible involves letting go or pausing to gain perspective.",
        "obstacles": "The obstacle is resistance to surrender. What blocks you is unwillingness to pause, let go, or sacrifice position.",
        "external_influences": "External forces demand pause. The world requires surrender and offers perspective in exchange."
      },
      "reversed": {
        "todays_guidance": "Today notice stalling or pointless sacrifice. Stuck in pause, martyrdom without wisdom, or refusing necessary surrender. Where has suspension become stuck?",
        "past": "Stalling or useless sacrifice shaped your path. A time when pause went too long or surrender was resisted. That stuck suspension echoes.",
        "present": "Right now pause has become stalling. Either refusing to surrender or stuck in pointless martyrdom. The suspension has lost its purpose.",
        "future": "Ahead lies reckoning with stuck pause. What's coming involves either finally surrendering or emerging from stalled suspension.",
        "situation": "The situation involves stuck pause. Stalling without wisdom, martyrdom without purpose, or refused surrender. Something about letting go has failed.",
        "action": "Unstick the pause. Either finally surrender or emerge from useless stalling. The action needed addresses what's stuck.",
        "outcome": "This leads to consequences of stuck surrender. The result shows what happens when pause becomes stalling or martyrdom loses meaning.",
        "challenge": "The challenge is stuck suspension. Either you won't let go or you've been hanging too long. Pause has become problem.",
        "above": "Your best hope involves unsticking the pause. The highest outcome requires either surrendering or emerging.",
        "below": "Beneath this situation lies fear of surrender or attachment to martyrdom. Unconscious stalling shapes everything visible.",
        "advice": "Unstick. Either surrender finally or emerge from pointless pause. The guidance is to find the purpose that's been lost.",
        "external": "Outside influences reflect stuck pause. Stalling circumstances or pressure to finally move or finally surrender.",
        "hopes_fears": "You fear permanent suspension—stuck forever in pause. Or you fear what happens when you finally emerge.",
        "hidden_influences": "A hidden factor is stuck surrender. Something not visible involves stalling or pointless martyrdom.",
        "obstacles": "The obstacle is the stuck pause itself. What blocks you is suspension that's lost its purpose.",
        "external_influences": "External forces reflect stalled surrender. The world shows you stuck pause or demands you finally move."
      }
    },
    "Temperance": {
      "upright": {
        "todays_guidance": "Today seek balance and patient integration. Moderation, blending opposites, the middle path. The day calls for gentle alchemy rather than force.",
        "past": "Balance and patience shaped your path. A time of integration, healing, or finding the middle way. That moderation brought you here.",
        "present": "Right now balance is needed. Patient blending, moderation, integration of opposites. This moment calls for Temperance's gentle alchemy.",
        "future": "Balance and healing approach. What's coming requires patience, moderation, and integration. Prepare for gentle blending.",
        "situation": "The situation calls for balance. Moderation, patience, blending what seems opposed. Healing through integration is possible here.",
        "action": "Seek balance. Blend patiently. The action required is moderation and gentle integration rather than extremes or force.",
        "outcome": "This leads to integration and balance. What seemed opposed is blended. The outcome is healing through patient moderation.",
        "challenge": "The challenge is finding balance. Moderation feels impossible, patience runs out, or opposites won't blend. Integration is stuck.",
        "above": "Your highest possibility is complete integration. The best outcome involves perfect balance and patient blending. Aim for Temperance's harmony.",
        "below": "Beneath this situation lies need for balance. Unconscious extremes or impatience shapes everything above.",
        "advice": "Blend patiently. Seek the middle. The guidance is moderation and gentle integration. What seems opposed can be combined.",
        "external": "Outside influences support balance. Someone models patience or circumstances call for moderation.",
        "hopes_fears": "You hope for harmony and healing—and fear the patience it requires. Balance feels both needed and slow.",
        "hidden_influences": "A hidden factor is need for integration. Something not visible involves balance or the blending of opposites.",
        "obstacles": "The obstacle is imbalance. What blocks you involves extremes, impatience, or inability to integrate.",
        "external_influences": "External forces call for balance. The world requires moderation and offers integration."
      },
      "reversed": {
        "todays_guidance": "Today notice imbalance and impatience. Extremes, failed integration, rushing when slowness is needed. Where has moderation failed?",
        "past": "Imbalance or impatience shaped your path. A time when moderation failed, extremes dominated, or integration wouldn't happen. That discord echoes.",
        "present": "Right now balance is failing. Extremes dominate, patience breaks, or what should blend won't. Integration is stuck.",
        "future": "Ahead lies reckoning with imbalance. What's coming involves either finding moderation or facing consequences of extremes.",
        "situation": "The situation involves broken balance. Impatience, extremes, or failed integration. Something about moderation has failed.",
        "action": "Address the imbalance. Find patience or release extremes. The action needed restores moderation.",
        "outcome": "This leads to consequences of imbalance. The result shows what happens when moderation fails or extremes dominate.",
        "challenge": "The challenge is broken balance. Impatience, extremes, or failed integration. Moderation is the obstacle.",
        "above": "Your best hope involves restoring balance. The highest outcome requires finding patience and moderation again.",
        "below": "Beneath this situation lies hidden imbalance. Unconscious extremes or impatience shapes everything visible.",
        "advice": "Find the balance you've lost. Slow down, seek the middle. The guidance is to address extremes and restore patience.",
        "external": "Outside influences reflect imbalance. Extreme circumstances or pressure that breaks patience.",
        "hopes_fears": "You fear ongoing imbalance—never finding moderation, always in extremes. Harmony feels impossible.",
        "hidden_influences": "A hidden factor is extremes or impatience. Something not visible involves broken balance shaping outcomes.",
        "obstacles": "The obstacle is imbalance. What blocks you involves extremes, impatience, or failed integration.",
        "external_influences": "External forces reflect or create imbalance. The world presents extremes or tests your moderation."
      }
    },
    "The Devil": {
      "upright": {
        "todays_guidance": "Today examine what binds you. Attachments, shadow patterns, chains chosen. The day asks what controls you and whether you see the bars.",
        "past": "Bondage or shadow shaped your path. A time when attachments controlled, the shadow ruled, or chains were accepted. That binding brought you here.",
        "present": "Right now something binds you. Attachments, shadow patterns, chosen chains. This moment asks you to see what controls you.",
        "future": "Shadow work or bondage approaches. What's coming involves facing attachments, confronting shadow, or recognizing chains. Prepare to see clearly.",
        "situation": "The situation involves bondage. Attachments, shadow patterns, something that controls. The question is whether you see the chains.",
        "action": "Examine what binds. Face the shadow. The action required is seeing clearly what controls you—the first step to freedom.",
        "outcome": "This leads to confrontation with bondage. What binds becomes visible. The outcome involves either continued captivity or beginning of freedom.",
        "challenge": "The challenge is the shadow or the chains. Attachment, addiction, or patterns that control. What binds you is the obstacle.",
        "above": "Your highest possibility is freedom through awareness. The best outcome involves seeing and releasing what binds. Aim for liberation.",
        "below": "Beneath this situation lies shadow material. Unconscious attachments, addictions, or fears that control. Bondage operates invisibly.",
        "advice": "See the chains. Face the shadow. The guidance is to recognize what binds you—you can't release what you won't acknowledge.",
        "external": "Outside influences involve bondage. Situations or people that bind, or external circumstances revealing your attachments.",
        "hopes_fears": "You hope to break free—and fear what you'll find when you face the shadow. Liberation and the chains both frighten.",
        "hidden_influences": "A hidden factor is unconscious bondage. Something not visible involves attachments, shadow, or control.",
        "obstacles": "The obstacle is what binds you. Attachments, shadow patterns, or chosen chains that you won't or can't release.",
        "external_influences": "External forces involve bondage. The world presents or reflects what controls you."
      },
      "reversed": {
        "todays_guidance": "Today notice freedom emerging or bondage resisted. Breaking chains, facing shadow, beginning liberation. Or deeper denial of what binds.",
        "past": "Breaking free or deeper bondage shaped your path. A time when chains were released or when you finally saw—or refused to see—what controlled you.",
        "present": "Right now freedom is possible or bondage is deepening. Either seeing and releasing what binds, or pushing further into denial.",
        "future": "Ahead lies liberation or deeper bondage. What's coming involves either breaking free or confronting what you won't acknowledge.",
        "situation": "The situation involves shifting bondage. Either chains loosening or denial deepening. Something about shadow and attachment is changing.",
        "action": "Complete the liberation. Break the chains fully. Or face what you're still denying. The action needed finishes the freeing.",
        "outcome": "This leads to freedom or deeper captivity. The result shows what happens when bondage is challenged—release or reinforcement.",
        "challenge": "The challenge is completing liberation. Chains loosen but don't fall. Or denial prevents seeing what still binds.",
        "above": "Your best hope is complete freedom. The highest outcome involves full release from what controlled you.",
        "below": "Beneath this situation lies partial liberation or hidden denial. Unconscious attachments still operate.",
        "advice": "Complete the breaking free. Or face what you're still denying. The guidance is to finish the liberation that's begun.",
        "external": "Outside influences support or reflect liberation. Circumstances help break chains or reveal remaining bondage.",
        "hopes_fears": "You hope for complete freedom—and fear it or fear what remains bound. Liberation feels both close and uncertain.",
        "hidden_influences": "A hidden factor is partial freedom or remaining bondage. Something not visible involves incomplete liberation.",
        "obstacles": "The obstacle is incomplete freedom. What blocks you is chains not fully broken or shadow not fully faced.",
        "external_influences": "External forces support liberation. The world helps break bonds or reveals what's still attached."
      }
    },
    "The Tower": {
      "upright": {
        "todays_guidance": "Today expect sudden change. Destruction of false structures, revelation, collapse. The day brings the lightning strike—terrifying but liberating.",
        "past": "Sudden destruction shaped your path. A time when everything fell, truth struck like lightning, or false foundations collapsed. That upheaval brought you here.",
        "present": "Right now everything falls. Sudden change, revelation, destruction of what was built on false foundation. This moment is the Tower struck.",
        "future": "Upheaval approaches. What's coming involves sudden collapse, truth revealed, or false structures destroyed. Prepare for lightning.",
        "situation": "The situation involves destruction. Sudden collapse, revelation, false foundations exposed. The Tower is at work here.",
        "action": "Let it fall. Don't cling to collapsing structures. The action required is accepting destruction rather than fighting it.",
        "outcome": "This leads to complete collapse and clearing. What was false is destroyed. The outcome is rubble—and space for rebuilding.",
        "challenge": "The challenge is the destruction itself. Sudden collapse, unwelcome revelation. What's falling is the obstacle and the liberation.",
        "above": "Your highest possibility is liberation through collapse. The best outcome involves false structures completely destroyed, truth fully revealed.",
        "below": "Beneath this situation lies false foundation. Unconscious structures built on illusion shape everything—until they fall.",
        "advice": "Let it fall. Stop defending what's collapsing. The guidance is to accept the destruction as liberation. Truth breaks illusion.",
        "external": "Outside influences bring upheaval. Sudden external change, or circumstances that expose false foundations.",
        "hopes_fears": "You hope for liberation after collapse—and fear the destruction required. The Tower is both nightmare and awakening.",
        "hidden_influences": "A hidden factor is unstable foundation. Something not visible involves collapse coming or false structure ready to fall.",
        "obstacles": "The obstacle is the collapse itself. What blocks you is destruction—but the falling is also the clearing.",
        "external_influences": "External forces bring upheaval. The world presents sudden change or collapses what you've built."
      },
      "reversed": {
        "todays_guidance": "Today notice averted destruction or internal upheaval. Either the collapse was prevented or it happens inside. Where is the Tower energy going?",
        "past": "Averted or internalized collapse shaped your path. A time when destruction was resisted, delayed, or experienced internally. That dodged or absorbed upheaval echoes.",
        "present": "Right now destruction is averted or internalized. Either the Tower is resisted, or the collapse happens inside rather than outside.",
        "future": "Ahead lies either prevented collapse or internal upheaval. What's coming involves disaster averted or anxiety about what might fall.",
        "situation": "The situation involves resisted or internalized destruction. Either collapse is prevented or experienced as internal chaos.",
        "action": "Address the blocked collapse. Either let what needs to fall finally fall, or process the internal upheaval. The action needed faces the Tower energy.",
        "outcome": "This leads to consequences of resisted destruction. The result shows what happens when collapse is prevented or internalized.",
        "challenge": "The challenge is blocked upheaval. Either destruction is resisted that shouldn't be, or internal chaos needs release.",
        "above": "Your best hope involves right relationship with destruction. The highest outcome requires either accepting needed collapse or processing internal upheaval.",
        "below": "Beneath this situation lies fear of collapse. Unconscious resistance to necessary destruction shapes everything visible.",
        "advice": "Address the Tower energy. Let fall what needs to, or process internal chaos. The guidance is to stop resisting necessary destruction.",
        "external": "Outside influences involve averted or blocked collapse. Circumstances prevent destruction or externalize internal chaos.",
        "hopes_fears": "You fear the collapse still coming—or fear the internal chaos won't resolve. Destruction feels both postponed and inevitable.",
        "hidden_influences": "A hidden factor is blocked destruction. Something not visible involves resisted collapse or internal upheaval.",
        "obstacles": "The obstacle is resistance to destruction. What blocks you involves preventing collapse that's needed or internalizing chaos.",
        "external_influences": "External forces either prevent or delay collapse. The world helps you avoid destruction or reflects internal chaos."
      }
    },
    "The Moon": {
      "upright": {
        "todays_guidance": "Today navigate by reflected light. Dreams, fears, intuition—things aren't as they seem. The day asks you to trust what you sense but can't see clearly.",
        "past": "Illusion and unconscious forces shaped your path. A time when things weren't as they seemed, when dreams or fears guided. That navigation by moonlight brought you here.",
        "present": "Right now illusion and intuition operate. Things aren't what they appear. Dreams, fears, unconscious currents shape this moment.",
        "future": "Mystery and illusion approach. What's coming involves unclear paths, unconscious material surfacing, or trusting what you can't see clearly.",
        "situation": "The situation involves illusion and mystery. Nothing is as it seems. Trust intuition even when—especially when—clarity fails.",
        "action": "Navigate by intuition. Trust what you sense beneath the surface. The action required accepts uncertainty and follows inner guidance.",
        "outcome": "This leads through mystery. What was unclear remains unclear, but the journey is made. The outcome involves unconscious material integrated or still surfacing.",
        "challenge": "The challenge is the uncertainty itself. Illusion, fear, or unclear path. What you can't see clearly is the obstacle.",
        "above": "Your highest possibility is navigation through mystery. The best outcome involves trusting intuition through darkness.",
        "below": "Beneath this situation lies the unconscious. Dreams, fears, hidden material shapes everything above. The depths stir.",
        "advice": "Trust intuition. Accept the mystery. The guidance is to navigate by what you sense, not what you see. The path is unclear; walk it anyway.",
        "external": "Outside influences involve mystery and illusion. Circumstances aren't what they seem, or external events stir unconscious material.",
        "hopes_fears": "You hope for clarity—and fear what emerges from the depths. The mystery is both alluring and terrifying.",
        "hidden_influences": "A hidden factor is unconscious material. Something not visible involves dreams, fears, or illusions shaping outcomes.",
        "obstacles": "The obstacle is the unclear path. What blocks you is illusion, fear, or inability to see. Trust anyway.",
        "external_influences": "External forces involve mystery and the unconscious. The world presents illusion or stirs what's hidden."
      },
      "reversed": {
        "todays_guidance": "Today notice clarity emerging or fears retreating. Illusions dispersing, truth surfacing. Or deeper denial of what lurks beneath.",
        "past": "Emerging clarity or suppressed fear shaped your path. A time when illusion dispersed or unconscious material was pushed deeper. That shift echoes.",
        "present": "Right now clarity emerges or fear is denied. Either the fog lifts and truth surfaces, or deeper repression occurs.",
        "future": "Ahead lies either clarity or continued confusion. What's coming involves illusions dispersing or unconscious material demanding attention.",
        "situation": "The situation involves shifting illusion. Either clarity emerging or deeper denial. Something about the hidden is changing.",
        "action": "Accept the emerging truth. Or face what you're repressing. The action needed works with clearing illusion or surfacing fear.",
        "outcome": "This leads to either clarity or consequences of denial. The result shows what happens when illusion disperses or is reinforced.",
        "challenge": "The challenge is partial clarity. Either truth not fully emerging or fears not fully faced. The fog thins but doesn't lift.",
        "above": "Your best hope is complete clarity. The highest outcome involves illusions fully dispersed and truth visible.",
        "below": "Beneath this situation lies suppressed fear or emerging truth. Unconscious material either surfaces or goes deeper.",
        "advice": "Let the clarity come. Stop repressing. The guidance is to accept what emerges from the depths rather than pushing it back.",
        "external": "Outside influences support clarity. Circumstances help disperse illusion or force facing what's hidden.",
        "hopes_fears": "You hope for clear seeing—and fear what you'll see. Truth is both wanted and frightening.",
        "hidden_influences": "A hidden factor is emerging truth or deepening denial. Something not visible involves illusion shifting.",
        "obstacles": "The obstacle is incomplete clarity. What blocks you involves partially dispersed illusion or partially faced fear.",
        "external_influences": "External forces support or demand clarity. The world helps disperse fog or insists you face what's hidden."
      }
    },
    "The Sun": {
      "upright": {
        "todays_guidance": "Today joy is available. Success, clarity, vitality—everything illuminated. The day invites uncomplicated happiness and full confidence.",
        "past": "Joy and success shaped your path. A time when everything was clear, happiness was real, energy was high. That brightness brought you here.",
        "present": "Right now joy is available. Success, clarity, vitality—this moment is the Sun shining. Everything is illuminated.",
        "future": "Joy and success approach. What's coming brings clarity, vitality, and genuine happiness. Prepare for brightness.",
        "situation": "The situation holds joy and clarity. Success is possible. Everything is visible, nothing hidden. Light dominates.",
        "action": "Embrace the joy. Step into the light with confidence. The action required is full expression and uninhibited happiness.",
        "outcome": "This leads to joy and success. What was hoped for realizes. The outcome is brightness, clarity, celebration.",
        "challenge": "The challenge is accepting joy. Light available but you struggle to step into it. Happiness is the opportunity you're missing.",
        "above": "Your highest possibility is complete joy. The best outcome involves full happiness, total success, uninhibited light.",
        "below": "Beneath this situation lies capacity for joy. Unconscious vitality and confidence shape everything above.",
        "advice": "Step into the light. Accept the joy. The guidance is to stop holding back from happiness. The Sun shines—bask in it.",
        "external": "Outside influences offer joy. Someone brings brightness, or circumstances provide success and clarity.",
        "hopes_fears": "You hope for lasting happiness—and fear it won't last or you don't deserve it. Joy feels both wanted and precarious.",
        "hidden_influences": "A hidden factor is available joy. Something not visible involves happiness and success waiting to be claimed.",
        "obstacles": "The obstacle is blocked joy. What blocks you is inability to accept the light. The Sun shines; step into it.",
        "external_influences": "External forces offer success and joy. The world presents opportunities for happiness and clarity."
      },
      "reversed": {
        "todays_guidance": "Today notice dimmed joy or delayed success. Clouds over the sun, happiness blocked. Where has brightness faded?",
        "past": "Dimmed joy or delayed success shaped your path. A time when happiness was blocked, when the sun was hidden. That shadow echoes.",
        "present": "Right now joy is dimmed. Success delayed, happiness blocked, vitality low. The Sun is there but clouds cover it.",
        "future": "Ahead lies reckoning with blocked joy. What's coming involves either the sun emerging or continued dimness.",
        "situation": "The situation involves blocked brightness. Joy available but not accessed. Success delayed. Something dims the light.",
        "action": "Address what blocks the light. Seek the joy beneath the clouds. The action needed clears what dims happiness.",
        "outcome": "This leads to consequences of dimmed joy. The result shows what happens when happiness is blocked or success delayed.",
        "challenge": "The challenge is blocked brightness. Joy available but unreachable. Success possible but delayed. Something dims.",
        "above": "Your best hope is recovered joy. The highest outcome involves clearing the clouds and stepping into available light.",
        "below": "Beneath this situation lies suppressed joy. Unconscious blocks to happiness shape everything visible.",
        "advice": "Clear what blocks the light. The guidance is to find and address what dims available joy. The sun is there—find it.",
        "external": "Outside influences dim joy. Circumstances block happiness or delay success. External clouds cover available light.",
        "hopes_fears": "You fear permanent dimness—joy never accessible, success never arriving. The clouds feel permanent.",
        "hidden_influences": "A hidden factor is blocked joy. Something not visible involves happiness that can't be reached.",
        "obstacles": "The obstacle dims the light. What blocks you is whatever covers available joy. Address it.",
        "external_influences": "External forces block joy. The world presents circumstances that delay success or dim happiness."
      }
    },
    "Judgement": {
      "upright": {
        "todays_guidance": "Today answer the call. Awakening, reckoning, purpose—the trumpet sounds. The day asks you to rise to what you're meant to become.",
        "past": "Awakening shaped your path. A time when the call sounded, when you rose or didn't, when reckoning happened. That moment brought you here.",
        "present": "Right now the call sounds. Awakening is happening. This moment asks you to rise, to reckon, to answer your purpose.",
        "future": "Awakening approaches. What's coming involves reckoning, rising, answering the call. Prepare to become who you're meant to be.",
        "situation": "The situation involves awakening and calling. Reckoning happens here. The trumpet sounds and you must answer.",
        "action": "Answer the call. Rise. The action required is responding to awakening, accepting reckoning, embracing purpose.",
        "outcome": "This leads to awakening and renewal. What was called rises. The outcome is rebirth through answering.",
        "challenge": "The challenge is answering. The call sounds but you struggle to rise. Purpose is there but not yet answered.",
        "above": "Your highest possibility is complete awakening. The best outcome involves fully answering the call and rising to purpose.",
        "below": "Beneath this situation lies calling and purpose. Unconscious knowing of what you're meant to be shapes everything.",
        "advice": "Answer. Rise. The guidance is to hear the call and respond. You know what you're being asked to become.",
        "external": "Outside influences involve calling. Someone or something sounds the trumpet, demands awakening.",
        "hopes_fears": "You hope to answer the call—and fear the reckoning or the change it requires. Awakening is both desired and daunting.",
        "hidden_influences": "A hidden factor is calling not yet heard. Something not visible involves purpose waiting to be answered.",
        "obstacles": "The obstacle is unanswered calling. What blocks you is failing to hear or refusing to rise. The trumpet sounds.",
        "external_influences": "External forces sound the call. The world demands awakening and reckoning."
      },
      "reversed": {
        "todays_guidance": "Today notice ignored calling or self-doubt. The trumpet sounds but goes unanswered. Where are you refusing awakening?",
        "past": "Ignored calling or failed reckoning shaped your path. A time when the trumpet sounded but wasn't answered. That refusal echoes.",
        "present": "Right now the call goes unanswered. Self-doubt blocks awakening, or reckoning is refused. Purpose waits, unmet.",
        "future": "Ahead lies reckoning with ignored calling. What's coming involves either finally answering or consequences of refusal.",
        "situation": "The situation involves blocked awakening. The call sounds but isn't heard or answered. Reckoning is avoided.",
        "action": "Address the blocked calling. Hear and answer. The action needed responds to what you've been refusing.",
        "outcome": "This leads to consequences of unanswered call. The result shows what happens when awakening is ignored.",
        "challenge": "The challenge is blocked awakening. Self-doubt, refusal, or inability to hear. The call sounds unanswered.",
        "above": "Your best hope is finally answering. The highest outcome involves hearing and rising to what's been calling.",
        "below": "Beneath this situation lies refused calling. Unconscious self-doubt or avoidance of purpose shapes everything.",
        "advice": "Hear. Answer. The guidance is to stop refusing the call. Self-doubt is the only thing blocking your rising.",
        "external": "Outside influences reflect blocked calling. Circumstances prevent hearing or models of refused awakening.",
        "hopes_fears": "You fear never answering—the call going permanently unheard. Or you fear what answering would require.",
        "hidden_influences": "A hidden factor is ignored calling. Something not visible involves purpose refused or reckoning avoided.",
        "obstacles": "The obstacle is the unanswered call. What blocks you is refusing or failing to hear the awakening.",
        "external_influences": "External forces reflect blocked awakening. The world shows consequences of unanswered calling."
      }
    },
    "The World": {
      "upright": {
        "todays_guidance": "Today celebrate completion. Wholeness, achievement, integration—a cycle ends. The day marks fulfillment and the threshold of new beginning.",
        "past": "Completion shaped your path. A time when a cycle finished, wholeness was achieved, or integration happened. That fulfillment brought you here.",
        "present": "Right now completion is happening. Wholeness, achievement, integration—this moment is the World realized. A cycle ends.",
        "future": "Completion approaches. What's coming brings fulfillment, wholeness, and the end of a cycle. Prepare for achievement.",
        "situation": "The situation involves completion. A cycle finishes, wholeness is possible. Integration and achievement are at hand.",
        "action": "Complete the cycle. Integrate what you've learned. The action required is bringing to closure and celebrating wholeness.",
        "outcome": "This leads to fulfillment and completion. What was begun is finished. The outcome is wholeness achieved, cycle closed.",
        "challenge": "The challenge is completing. The cycle almost finished, wholeness almost achieved. Integration is near but not realized.",
        "above": "Your highest possibility is complete integration. The best outcome involves full achievement, total wholeness, cycle perfectly closed.",
        "below": "Beneath this situation lies readiness for completion. Unconscious wholeness shapes everything, waiting to be realized.",
        "advice": "Complete. Integrate. The guidance is to finish what you've started and celebrate the wholeness you've achieved.",
        "external": "Outside influences support completion. Circumstances help close cycles or recognize achievement.",
        "hopes_fears": "You hope for completion and wholeness—and fear it won't happen or fear what follows. Ending feels both fulfilling and uncertain.",
        "hidden_influences": "A hidden factor is available completion. Something not visible involves wholeness waiting to be realized.",
        "obstacles": "The obstacle is incomplete cycle. What blocks you is final integration not yet achieved. Almost whole, not yet there.",
        "external_influences": "External forces support completion. The world provides closure and celebrates achievement."
      },
      "reversed": {
        "todays_guidance": "Today notice incomplete cycles or lack of closure. Almost there but not quite. Where has completion stalled?",
        "past": "Incomplete cycles shaped your path. A time when closure didn't come, wholeness wasn't achieved. That lack of completion echoes.",
        "present": "Right now completion stalls. Almost there but not quite. Integration fails or closure is blocked. The cycle won't close.",
        "future": "Ahead lies reckoning with incompletion. What's coming involves either finally finishing or consequences of stalled cycles.",
        "situation": "The situation involves blocked completion. Almost finished but not quite. Something prevents closing the cycle.",
        "action": "Address the incompletion. Find what blocks closure. The action needed finishes what's almost done.",
        "outcome": "This leads to consequences of incompletion. The result shows what happens when cycles don't close or wholeness isn't achieved.",
        "challenge": "The challenge is stalled completion. Almost there but blocked. Integration fails at the last step.",
        "above": "Your best hope is finally completing. The highest outcome involves finishing what's been almost done.",
        "below": "Beneath this situation lies fear of completion or hidden incompletion. Unconscious blocks to closure shape everything.",
        "advice": "Finish. Find what blocks and address it. The guidance is to complete the cycle that's been stalling.",
        "external": "Outside influences block completion. Circumstances prevent closure or delay achievement.",
        "hopes_fears": "You fear permanent incompletion—never quite finishing, never quite whole. The almost-there feels endless.",
        "hidden_influences": "A hidden factor is blocked completion. Something not visible prevents the cycle from closing.",
        "obstacles": "The obstacle is incompletion. What blocks you is the final step not taken, the integration not made.",
        "external_influences": "External forces delay completion. The world prevents closure or reflects stalled cycles."
      }
    },
    "Ace of Wands": {
      "upright": {
        "todays_guidance": "Today a creative spark ignites. New inspiration, fresh energy, passionate beginning. Act on it while it's hot. The day offers a seed of fire.",
        "past": "A burst of inspiration shaped your path. A moment when creative or passionate energy sparked something new. That ignition brought you here.",
        "present": "Right now new creative energy is available. The spark ignites. This moment offers the beginning of something passionate and alive.",
        "future": "Creative inspiration approaches. What's coming brings new passionate energy, fresh initiative. Prepare to catch the spark.",
        "situation": "The situation offers new creative fire. An opportunity for passionate beginning. The wand extends—will you take it?",
        "action": "Seize the spark. Act on inspiration now. The action required is beginning with passion, not waiting for perfect conditions.",
        "outcome": "This leads to new creative initiative. The spark catches fire. The outcome is passionate beginning realized.",
        "challenge": "The challenge is acting on inspiration. The spark appears but you hesitate. Creative energy is available but not seized.",
        "above": "Your highest possibility is passionate new creation. The best outcome involves fully embracing the creative spark.",
        "below": "Beneath this situation lies creative potential. Unconscious passion waiting to ignite shapes everything.",
        "advice": "Take the wand. Act on the spark. The guidance is to begin now while the fire is fresh. Inspiration fades if not acted upon.",
        "external": "Outside influences offer creative opportunity. Someone or something brings the spark. Circumstances invite passionate beginning.",
        "hopes_fears": "You hope for fresh creative energy—and fear it won't last or you'll waste it. The spark feels both exciting and pressuring.",
        "hidden_influences": "A hidden factor is creative potential. Something not visible involves inspiration waiting to ignite.",
        "obstacles": "The obstacle blocks creative beginning. What prevents you from seizing the spark must be addressed.",
        "external_influences": "External forces offer creative fire. The world presents passionate opportunities."
      },
      "reversed": {
        "todays_guidance": "Today notice blocked or wasted creative energy. False starts, delays, sparks that won't catch. Where is passion being stifled?",
        "past": "Blocked creativity or false starts shaped your path. A time when inspiration came but didn't ignite. That failed spark echoes.",
        "present": "Right now creative energy is blocked. The spark appears but won't catch. Delays, false starts, or wasted potential.",
        "future": "Ahead lies reckoning with blocked creativity. What's coming involves either finally igniting or addressing why sparks fail.",
        "situation": "The situation involves stifled creative fire. False starts, blocked passion, inspiration that won't translate to action.",
        "action": "Address what blocks the spark. Find why creativity stalls. The action needed clears obstacles to passionate beginning.",
        "outcome": "This leads to consequences of blocked creativity. The result shows what happens when sparks don't catch.",
        "challenge": "The challenge is blocked inspiration. Creative energy available but not igniting. The spark needs clearing to catch.",
        "above": "Your best hope involves clearing creative blocks. The highest outcome requires getting the spark to finally catch.",
        "below": "Beneath this situation lies suppressed creative energy. Unconscious blocks to passion shape everything.",
        "advice": "Find what blocks the fire. Clear obstacles to creativity. The guidance is to address why inspiration isn't translating to action.",
        "external": "Outside influences block creativity. Circumstances stifle passion or cause false starts.",
        "hopes_fears": "You fear permanent creative block—sparks never catching, passion never igniting. The false starts feel discouraging.",
        "hidden_influences": "A hidden factor blocks creativity. Something not visible prevents passionate beginning.",
        "obstacles": "The obstacle is the creative block itself. What prevents sparks from catching is what must be addressed.",
        "external_influences": "External forces stifle creativity. The world presents delays or blocks to passionate initiative."
      }
    },
    "Two of Wands": {
      "upright": {
        "todays_guidance": "Today plan and envision. The world is in your hands—now what will you do? The day calls for strategic thinking before expansion.",
        "past": "Planning and vision shaped your path. A time when you held options and chose direction. That strategic moment brought you here.",
        "present": "Right now you hold the world in your hands. Planning, envisioning, weighing options. This moment asks what you'll do with your power.",
        "future": "Decision and expansion approach. What's coming requires choosing direction from position of power. Prepare to select your path.",
        "situation": "The situation calls for strategic vision. Options exist, power is held. The question is which direction to expand.",
        "action": "Plan before acting. Choose direction deliberately. The action required is strategic vision, not impulsive movement.",
        "outcome": "This leads to chosen direction and expansion. What was planned begins to manifest. The outcome is vision becoming path.",
        "challenge": "The challenge is choosing direction. Options exist but decision paralyzes. Power is held without being deployed.",
        "above": "Your highest possibility is masterful strategic expansion. The best outcome involves choosing well and moving with power.",
        "below": "Beneath this situation lies ambition and desire to expand. Unconscious vision shapes the options you see.",
        "advice": "Choose your direction. The guidance is to decide from power, not fear. The world is offered—take it deliberately.",
        "external": "Outside influences present options. Circumstances offer expansion in multiple directions. The world waits for your choice.",
        "hopes_fears": "You hope to choose wisely—and fear choosing wrong. The options feel both empowering and overwhelming.",
        "hidden_influences": "A hidden factor involves unexplored options. Something not visible affects which direction serves best.",
        "obstacles": "The obstacle is indecision or fear of commitment. What blocks you is unwillingness to choose a direction.",
        "external_influences": "External forces present options for expansion. The world offers multiple paths forward."
      },
      "reversed": {
        "todays_guidance": "Today notice fear of expansion or poor planning. Stuck in comfort zones, paralyzed by options. Where is vision failing?",
        "past": "Fear of the unknown or failed planning shaped your path. A time when options existed but weren't chosen. That paralysis echoes.",
        "present": "Right now expansion is blocked. Fear of the unknown, poor planning, or inability to choose direction. The world is held but not taken.",
        "future": "Ahead lies reckoning with blocked expansion. What's coming requires addressing fear of choice or poor planning.",
        "situation": "The situation involves blocked vision. Fear of expansion, analysis paralysis, playing it safe when boldness is needed.",
        "action": "Address the fear or planning failure. Choose despite uncertainty. The action needed moves past the paralysis.",
        "outcome": "This leads to consequences of blocked expansion. The result shows what happens when options aren't chosen.",
        "challenge": "The challenge is fear of choosing. Options exist but fear prevents action. Safety feels more compelling than growth.",
        "above": "Your best hope involves choosing despite fear. The highest outcome requires moving past paralysis into expansion.",
        "below": "Beneath this situation lies fear of the unknown. Unconscious resistance to expansion shapes the paralysis.",
        "advice": "Choose anyway. Fear of wrong choice isn't better than no choice. The guidance is to move past paralysis.",
        "external": "Outside influences reinforce fear or block expansion. Circumstances seem to justify playing safe.",
        "hopes_fears": "You fear making the wrong choice—so you make none. The paralysis feels protective but costs you options.",
        "hidden_influences": "A hidden factor is fear of expansion. Something not visible keeps you in comfort zones.",
        "obstacles": "The obstacle is the paralysis itself. What blocks you is fear of choosing or leaving safety behind.",
        "external_influences": "External forces reinforce caution. The world seems to confirm that staying put is safer."
      }
    },
    "Three of Wands": {
      "upright": {
        "todays_guidance": "Today watch your ships sail. Plans are in motion, expansion underway. The day calls for foresight and patience as endeavors unfold.",
        "past": "Expansion and foresight shaped your path. A time when you watched plans unfold, when ships were sent out. That vision becoming reality brought you here.",
        "present": "Right now plans are in motion. You stand watching endeavors unfold. This moment is the expansion already begun.",
        "future": "Results of planning approach. What's coming shows returns on what was launched. Prepare to see visions materialize.",
        "situation": "The situation involves plans unfolding. Expansion happening, endeavors moving forward. Watch and guide what's been set in motion.",
        "action": "Maintain oversight of what's launched. Guide expansion with foresight. The action required is patient watching and course-correcting.",
        "outcome": "This leads to plans realized. What was launched returns. The outcome is expansion achieved, vision manifesting.",
        "challenge": "The challenge is maintaining foresight. Plans are moving but guidance is needed. Expansion requires continued attention.",
        "above": "Your highest possibility is successful expansion. The best outcome involves plans returning with increase.",
        "below": "Beneath this situation lies vision already enacted. Unconscious confidence in what's been launched shapes events.",
        "advice": "Watch and wait actively. The guidance is to maintain oversight as plans unfold. Foresight continues to matter.",
        "external": "Outside influences affect expansion. Circumstances shape how plans unfold. External factors bring news of endeavors.",
        "hopes_fears": "You hope plans succeed—and fear they won't return. Waiting tests patience while outcomes remain uncertain.",
        "hidden_influences": "A hidden factor is how plans are progressing. Something not visible affects the expansion underway.",
        "obstacles": "The obstacle threatens expansion. What blocks you may affect plans already in motion. Course correction may be needed.",
        "external_influences": "External forces affect plans in motion. The world shapes how endeavors unfold and return."
      },
      "reversed": {
        "todays_guidance": "Today notice delayed returns or failed foresight. Plans not materializing, expansion stalled. Where has vision fallen short?",
        "past": "Delayed expansion or failed foresight shaped your path. A time when ships didn't return or plans stalled. That failed expansion echoes.",
        "present": "Right now expansion delays. Plans aren't materializing as expected. Foresight proves incomplete or return is blocked.",
        "future": "Ahead lies reckoning with delayed plans. What's coming involves either course correction or accepting changed outcomes.",
        "situation": "The situation involves stalled expansion. Plans delayed, returns not coming, foresight failing. Something about vision isn't working.",
        "action": "Reassess the plans. Consider course correction. The action needed addresses why expansion stalls.",
        "outcome": "This leads to consequences of delayed expansion. The result shows what happens when plans don't unfold as expected.",
        "challenge": "The challenge is stalled plans. Expansion isn't happening as foreseen. Something about the vision needs adjusting.",
        "above": "Your best hope involves course correction. The highest outcome requires adjusting plans to reality.",
        "below": "Beneath this situation lies flawed foresight. Unconscious miscalculation shapes the delays.",
        "advice": "Reassess and adjust. The guidance is to correct course rather than waiting for failed plans to suddenly work.",
        "external": "Outside influences delay expansion. Circumstances block returns or change conditions from what was planned for.",
        "hopes_fears": "You fear plans are failing—ships lost, expansion impossible. The delays feel ominous.",
        "hidden_influences": "A hidden factor blocks expansion. Something not visible prevents plans from unfolding.",
        "obstacles": "The obstacle is what delays expansion. Identifying what blocks plans from materializing is essential.",
        "external_influences": "External forces delay or block expansion. The world presents obstacles to plans in motion."
      }
    },
    "Four of Wands": {
      "upright": {
        "todays_guidance": "Today celebrate what's been built. Stability, milestone, homecoming. The day calls for recognizing achievement and honoring community.",
        "past": "Celebration and stability shaped your path. A time of achievement recognized, community honored, home established. That foundation brought you here.",
        "present": "Right now celebration is warranted. Milestone reached, stability achieved, community gathered. This moment deserves honoring.",
        "future": "Celebration approaches. What's coming brings milestone recognition, community gathering, or homecoming. Prepare to honor achievement.",
        "situation": "The situation involves achieved stability. Something worth celebrating, a foundation built, community present. Honor what's been created.",
        "action": "Celebrate. Honor the milestone. The action required is recognizing achievement and gathering with those who matter.",
        "outcome": "This leads to celebrated stability. Achievement honored, community strengthened. The outcome is foundation recognized.",
        "challenge": "The challenge is accepting celebration. Stability exists but goes unrecognized. Achievement deserves honoring you're not giving it.",
        "above": "Your highest possibility is joyful stability. The best outcome involves fully celebrating what's been built.",
        "below": "Beneath this situation lies need for stable foundation. Unconscious desire for home and community shapes everything.",
        "advice": "Celebrate what you've built. The guidance is to honor achievement, gather community, and recognize the milestone.",
        "external": "Outside influences support celebration. Community gathers, circumstances recognize achievement. The world honors what's been built.",
        "hopes_fears": "You hope stability lasts—and fear the party ending. Celebration feels deserved but temporary.",
        "hidden_influences": "A hidden factor is the foundation's strength. Something not visible supports the stability being celebrated.",
        "obstacles": "The obstacle threatens stability. What blocks you could undermine what's been built. Protect while celebrating.",
        "external_influences": "External forces support celebration. The world provides community and recognition of milestones."
      },
      "reversed": {
        "todays_guidance": "Today notice unstable foundations or blocked celebration. Discord at home, delayed milestones. Where is stability lacking?",
        "past": "Instability or blocked celebration shaped your path. A time when home wasn't harmonious or milestones went unrecognized. That discord echoes.",
        "present": "Right now celebration is blocked. Instability at home, community fractured, or milestone not reached. Something about foundation is shaky.",
        "future": "Ahead lies reckoning with instability. What's coming involves either finding stability or addressing foundational problems.",
        "situation": "The situation involves shaky foundation. Celebration premature or blocked, community discordant, home unstable.",
        "action": "Address the instability. Fix what's shaky before celebrating. The action needed shores up the foundation.",
        "outcome": "This leads to consequences of instability. The result shows what happens when foundations aren't solid.",
        "challenge": "The challenge is unstable foundation. What should be solid isn't. The milestone can't be celebrated while shaking.",
        "above": "Your best hope involves stabilizing the foundation. The highest outcome requires addressing what's shaky.",
        "below": "Beneath this situation lies foundational problems. Unconscious discord affects what seems stable on surface.",
        "advice": "Fix the foundation. The guidance is to address instability before pretending everything's celebration-worthy.",
        "external": "Outside influences destabilize. Circumstances create discord at home or block community gathering.",
        "hopes_fears": "You fear ongoing instability—home never solid, community never gathered. The discord feels entrenched.",
        "hidden_influences": "A hidden factor undermines stability. Something not visible creates the discord or blocks celebration.",
        "obstacles": "The obstacle is the instability itself. What blocks you is foundational shakiness that must be addressed.",
        "external_influences": "External forces create instability. The world presents discord or blocks celebratory gathering."
      }
    },
    "Five of Wands": {
      "upright": {
        "todays_guidance": "Today expect competition or conflict. Multiple forces vying, creative tension. The day calls for channeling struggle productively.",
        "past": "Conflict or competition shaped your path. A time of multiple forces contending, struggle that forged something. That battle brought you here.",
        "present": "Right now conflict or competition is active. Multiple wills clash. This moment is the creative struggle.",
        "future": "Competition approaches. What's coming involves conflict, multiple forces, or creative tension. Prepare to contend.",
        "situation": "The situation involves competition. Multiple forces vying, conflict in process. The question is how you'll engage the struggle.",
        "action": "Engage the competition. Channel conflict productively. The action required is active struggle, not avoidance.",
        "outcome": "This leads through competition. What emerges from the struggle depends on how you contend. The outcome is forged in conflict.",
        "challenge": "The challenge is the competition itself. Multiple forces vie and you're in the middle. Struggle is unavoidable.",
        "above": "Your highest possibility is creative victory through struggle. The best outcome involves channeling competition productively.",
        "below": "Beneath this situation lies competitive energy. Unconscious drive to contend shapes the conflicts that arise.",
        "advice": "Engage productively. The guidance is to compete rather than avoid, but channel struggle toward creative ends.",
        "external": "Outside influences create competition. Multiple forces in environment vie. Circumstances demand you contend.",
        "hopes_fears": "You hope to prevail—and fear the exhaustion of ongoing struggle. Competition feels both energizing and draining.",
        "hidden_influences": "A hidden factor is the nature of the competition. Something not visible shapes how forces are contending.",
        "obstacles": "The obstacle is the competition itself. What blocks you involves other forces that must be contended with.",
        "external_influences": "External forces create competition. The world presents conflict and multiple contending wills."
      },
      "reversed": {
        "todays_guidance": "Today notice avoided conflict or internal struggle. Suppressed competition, internalized battle. Where is healthy struggle being dodged?",
        "past": "Avoided conflict or internal struggle shaped your path. A time when competition was suppressed or turned inward. That avoidance echoes.",
        "present": "Right now conflict is avoided or internalized. Competition suppressed, struggle happening inside rather than productively outside.",
        "future": "Ahead lies reckoning with avoided struggle. What's coming involves either engaging conflict or facing consequences of suppression.",
        "situation": "The situation involves avoided or internal conflict. Competition that should be engaged is dodged or turned inward.",
        "action": "Engage the avoided conflict. Stop internalizing struggle. The action needed brings competition into the open productively.",
        "outcome": "This leads to consequences of avoided struggle. The result shows what happens when conflict is suppressed.",
        "challenge": "The challenge is avoiding necessary conflict. Struggle that should be engaged is dodged. Competition festers.",
        "above": "Your best hope involves engaging avoided conflict. The highest outcome requires bringing struggle into the open.",
        "below": "Beneath this situation lies suppressed competitive energy. Unconscious conflict shapes what seems calm on surface.",
        "advice": "Stop avoiding. The guidance is to engage conflict productively rather than suppressing or internalizing it.",
        "external": "Outside influences suppress competition. Circumstances seem to prevent necessary struggle.",
        "hopes_fears": "You fear conflict—so you internalize it. The avoided struggle creates more suffering than engagement would.",
        "hidden_influences": "A hidden factor is suppressed conflict. Something not visible involves competition that should be engaged.",
        "obstacles": "The obstacle is avoidance. What blocks you is refusal to engage necessary conflict.",
        "external_influences": "External forces suppress conflict. The world seems to forbid the competition that needs to happen."
      }
    },
    "Six of Wands": {
      "upright": {
        "todays_guidance": "Today victory and recognition come. Success acknowledged, achievement celebrated. The day brings the triumph parade.",
        "past": "Victory and recognition shaped your path. A time when success was publicly acknowledged. That triumph brought you here.",
        "present": "Right now victory is achieved. Recognition comes, success acknowledged. This moment is the triumph.",
        "future": "Recognition approaches. What's coming brings public acknowledgment of success, celebration of victory. Prepare to be honored.",
        "situation": "The situation involves earned victory. Success achieved, recognition coming. The triumph parade assembles.",
        "action": "Accept the recognition. Own your victory. The action required is graciously receiving earned acknowledgment.",
        "outcome": "This leads to recognized success. Victory celebrated, achievement honored. The outcome is public triumph.",
        "challenge": "The challenge is accepting victory. Success is there but recognition feels uncomfortable. Own what you've earned.",
        "above": "Your highest possibility is full recognition of success. The best outcome involves earned victory publicly honored.",
        "below": "Beneath this situation lies drive for recognition. Unconscious need for acknowledgment shapes the pursuit of success.",
        "advice": "Accept the win. The guidance is to receive recognition graciously. You earned this victory.",
        "external": "Outside influences honor success. Others recognize and celebrate your victory. The world acknowledges achievement.",
        "hopes_fears": "You hope for recognition—and fear it won't come or won't last. Victory feels both earned and precarious.",
        "hidden_influences": "A hidden factor is how recognition will come. Something not visible shapes the celebration of success.",
        "obstacles": "The obstacle threatens recognition. What blocks you may prevent victory from being properly acknowledged.",
        "external_influences": "External forces bring recognition. The world celebrates success and honors achievement."
      },
      "reversed": {
        "todays_guidance": "Today notice blocked recognition or hollow victory. Success without acknowledgment, or ego undermining triumph. Where is victory going wrong?",
        "past": "Blocked recognition or egotism shaped your path. A time when success wasn't honored or pride preceded fall. That failed triumph echoes.",
        "present": "Right now recognition is blocked or corrupted. Victory hollow, success unacknowledged, or ego tainting achievement.",
        "future": "Ahead lies reckoning with blocked recognition. What's coming involves either finding proper acknowledgment or addressing pride's corruption.",
        "situation": "The situation involves troubled victory. Either success goes unrecognized or ego undermines achievement. Something about triumph is wrong.",
        "action": "Address what blocks recognition. Check ego if it corrupts. The action needed fixes what's wrong with success.",
        "outcome": "This leads to consequences of troubled victory. The result shows what happens when recognition fails or pride destroys.",
        "challenge": "The challenge is blocked or hollow victory. Success exists but isn't honored properly. Something prevents true triumph.",
        "above": "Your best hope involves proper recognition. The highest outcome requires fixing what blocks or corrupts victory.",
        "below": "Beneath this situation lies ego or fear of recognition. Unconscious issues with success shape the troubled victory.",
        "advice": "Check your ego. Or claim the recognition you're not receiving. The guidance depends on which shadow is active.",
        "external": "Outside influences block recognition. Circumstances prevent acknowledgment or inflate ego destructively.",
        "hopes_fears": "You fear success will be hollow—victory without meaning, recognition without substance. The triumph feels corrupted.",
        "hidden_influences": "A hidden factor blocks true recognition. Something not visible undermines proper acknowledgment of success.",
        "obstacles": "The obstacle is what corrupts victory. Either blocked recognition or inflated ego is what must be addressed.",
        "external_influences": "External forces block recognition. The world withholds acknowledgment or inflates ego dangerously."
      }
    },
    "Seven of Wands": {
      "upright": {
        "todays_guidance": "Today defend your position. Challenge comes from many directions. The day calls for standing your ground against opposition.",
        "past": "Defending your ground shaped your path. A time when you held position against challenges. That stand brought you here.",
        "present": "Right now you're challenged from multiple directions. Defense is necessary. This moment asks you to hold your ground.",
        "future": "Challenge approaches. What's coming requires defending your position. Prepare to stand against opposition.",
        "situation": "The situation involves defense. Multiple challenges to your position, need to hold ground. You've earned where you are—defend it.",
        "action": "Stand your ground. Don't back down. The action required is defending what you've earned against those who'd take it.",
        "outcome": "This leads to maintained position if you defend. What you hold depends on your willingness to stand. The outcome is earned through persistence.",
        "challenge": "The challenge is the opposition itself. Multiple forces challenge your position. Holding ground requires effort.",
        "above": "Your highest possibility is successful defense. The best outcome involves maintaining your earned position against all challengers.",
        "below": "Beneath this situation lies drive to protect what's yours. Unconscious territoriality shapes the defensive stance.",
        "advice": "Don't yield. The guidance is to hold your position. You earned this ground—it's worth defending.",
        "external": "Outside influences challenge your position. Others oppose, circumstances test your standing. The world demands defense.",
        "hopes_fears": "You hope to hold your ground—and fear being overrun. Defense feels both necessary and exhausting.",
        "hidden_influences": "A hidden factor shapes the opposition. Something not visible drives those who challenge your position.",
        "obstacles": "The obstacle is the opposition. What blocks you is the very challenge to your position that must be defended against.",
        "external_influences": "External forces challenge your standing. The world tests whether you'll maintain your position."
      },
      "reversed": {
        "todays_guidance": "Today notice overwhelm or giving up too easily. Overrun by opposition, or surrendering what shouldn't be given. Where is defense failing?",
        "past": "Failed defense or giving up shaped your path. A time when opposition overwhelmed or you surrendered prematurely. That loss echoes.",
        "present": "Right now defense is failing. Either overwhelmed by opposition or giving up too easily. Position is being lost.",
        "future": "Ahead lies reckoning with failed defense. What's coming involves either rallying or accepting loss of position.",
        "situation": "The situation involves failed defense. Position being lost, overwhelmed by opposition, or giving up prematurely.",
        "action": "Rally or accept strategically. Either renew defense or surrender wisely. The action needed addresses why position is being lost.",
        "outcome": "This leads to consequences of failed defense. The result shows what happens when position isn't maintained.",
        "challenge": "The challenge is maintaining defense. Opposition overwhelms or will to stand ground fails. Position slips.",
        "above": "Your best hope involves renewed defense. The highest outcome requires rallying to hold what's slipping.",
        "below": "Beneath this situation lies exhaustion or doubt. Unconscious giving up shapes the failing defense.",
        "advice": "Decide if this ground is worth holding. Rally if yes, surrender strategically if no. The guidance requires honest assessment.",
        "external": "Outside influences overwhelm defense. Circumstances favor opposition or drain your will to stand.",
        "hopes_fears": "You fear being overrun—position lost, defense failed. The exhaustion makes surrender tempting.",
        "hidden_influences": "A hidden factor weakens defense. Something not visible undermines your ability to hold position.",
        "obstacles": "The obstacle is the overwhelm. What blocks you is either too much opposition or insufficient will to stand.",
        "external_influences": "External forces overwhelm defense. The world presents opposition that threatens to overrun your position."
      }
    },
    "Eight of Wands": {
      "upright": {
        "todays_guidance": "Today everything accelerates. Swift movement, rapid progress, momentum. The day brings speed—act while things are moving.",
        "past": "Rapid movement shaped your path. A time when everything accelerated, when momentum carried you forward. That swift progress brought you here.",
        "present": "Right now everything moves fast. Momentum builds, progress accelerates. This moment is the arrows in flight.",
        "future": "Acceleration approaches. What's coming brings rapid progress and swift development. Prepare for speed.",
        "situation": "The situation involves rapid movement. Things accelerating, momentum building. Strike while everything moves.",
        "action": "Move with the momentum. Act swiftly. The action required rides the acceleration rather than fighting it.",
        "outcome": "This leads to rapid results. What's launched arrives quickly. The outcome comes fast.",
        "challenge": "The challenge is keeping up. Speed is available but overwhelming. Momentum requires riding, not directing.",
        "above": "Your highest possibility is swift successful movement. The best outcome involves riding momentum to rapid achievement.",
        "below": "Beneath this situation lies energy seeking expression. Unconscious drive for movement shapes the acceleration.",
        "advice": "Go with the flow. The guidance is to ride momentum rather than resist or over-control it. Speed is available—use it.",
        "external": "Outside influences accelerate everything. Messages, travel, developments all happen fast. The world moves quickly.",
        "hopes_fears": "You hope the momentum carries you forward—and fear losing control of the speed. Acceleration feels both exciting and scary.",
        "hidden_influences": "A hidden factor affects the direction of movement. Something not visible shapes where the acceleration leads.",
        "obstacles": "The obstacle is whatever slows momentum. What blocks you interrupts the acceleration that wants to happen.",
        "external_influences": "External forces create acceleration. The world moves fast, bringing rapid developments."
      },
      "reversed": {
        "todays_guidance": "Today notice delays or scattered energy. Arrows that won't fly, momentum blocked. Where has movement stalled?",
        "past": "Delays or scattered energy shaped your path. A time when momentum was blocked, when acceleration failed. That frustration echoes.",
        "present": "Right now movement stalls. Delays frustrate, energy scatters, the arrows hang mid-flight. Momentum is blocked.",
        "future": "Ahead lies reckoning with blocked movement. What's coming involves either unblocking momentum or accepting delays.",
        "situation": "The situation involves stalled movement. Delays, scattered energy, blocked acceleration. Something prevents swift progress.",
        "action": "Address what blocks movement. Find the delay's cause. The action needed unblocks the stalled momentum.",
        "outcome": "This leads to consequences of delay. The result shows what happens when momentum is blocked.",
        "challenge": "The challenge is stalled movement. Momentum that should flow is blocked. Acceleration won't happen.",
        "above": "Your best hope involves unblocking movement. The highest outcome requires addressing what causes delays.",
        "below": "Beneath this situation lies frustrated energy. Unconscious blocks prevent the movement that wants to happen.",
        "advice": "Find what blocks. The guidance is to identify and address delays rather than just pushing harder.",
        "external": "Outside influences create delays. Circumstances block movement or scatter energy. The world frustrates acceleration.",
        "hopes_fears": "You fear permanent stalling—momentum never returning, progress forever blocked. The delays feel endless.",
        "hidden_influences": "A hidden factor blocks movement. Something not visible causes the delays and scattered energy.",
        "obstacles": "The obstacle is the delay itself. What blocks you is whatever prevents momentum from building.",
        "external_influences": "External forces create delays. The world blocks movement or scatters energy that should be focused."
      }
    },
    "Nine of Wands": {
      "upright": {
        "todays_guidance": "Today persist despite weariness. You've been through battles but aren't defeated. The day calls for resilience—one more push may be needed.",
        "past": "Resilience through difficulty shaped your path. A time of surviving battles, persisting despite wounds. That endurance brought you here.",
        "present": "Right now you're battle-weary but still standing. Challenges have been faced, wounds carried. This moment asks for continued persistence.",
        "future": "Continued challenge approaches. What's coming requires the resilience you've built. Prepare for one more push.",
        "situation": "The situation involves persistent challenge. You've survived much but more is asked. Resilience is needed.",
        "action": "Keep standing. Persist despite weariness. The action required is continued endurance, not giving up now.",
        "outcome": "This leads through to what's beyond the challenge. Persistence pays off. The outcome rewards endurance.",
        "challenge": "The challenge is exhaustion itself. You've fought hard and weariness sets in. Persistence feels impossible but remains necessary.",
        "above": "Your highest possibility is resilient triumph. The best outcome involves persisting to victory despite weariness.",
        "below": "Beneath this situation lies survival instinct. Unconscious will to persist shapes your continued standing.",
        "advice": "Don't give up now. The guidance is to persist—you've come too far to stop. One more push may be all that's needed.",
        "external": "Outside influences continue to challenge. Circumstances test endurance. The world asks if you'll keep standing.",
        "hopes_fears": "You hope you have enough left to persist—and fear you're running on empty. Exhaustion makes continuing feel impossible.",
        "hidden_influences": "A hidden factor is how much more is required. Something not visible affects whether persistence will be enough.",
        "obstacles": "The obstacle is the weariness itself. What blocks you is exhaustion threatening to end persistence prematurely.",
        "external_influences": "External forces continue to test endurance. The world presents ongoing challenges to already-tired will."
      },
      "reversed": {
        "todays_guidance": "Today notice stubbornness or collapse. Either fighting past the point of wisdom or finally giving up. Where is resilience misapplied?",
        "past": "Collapsed endurance or foolish persistence shaped your path. A time when either you gave up too soon or held on past reason. That pattern echoes.",
        "present": "Right now resilience is failing or misapplied. Either collapsing when you shouldn't or persisting past wisdom.",
        "future": "Ahead lies reckoning with how you persist. What's coming involves either renewed endurance or wise surrender.",
        "situation": "The situation involves troubled persistence. Either collapsing or fighting foolishly. Something about resilience is wrong.",
        "action": "Assess honestly. Either renew endurance or surrender wisely. The action needed addresses the real situation, not pride.",
        "outcome": "This leads to consequences of misapplied resilience. The result shows what happens when persistence fails or becomes foolish.",
        "challenge": "The challenge is right relationship with persistence. Either you're giving up too easily or fighting past wisdom.",
        "above": "Your best hope involves right persistence. The highest outcome requires either renewed endurance or wise release.",
        "below": "Beneath this situation lies confused will. Unconscious stubbornness or fear of failure shapes troubled persistence.",
        "advice": "Be honest about what's left. Renew if there's fight remaining; release if persistence is foolish. The guidance requires honest assessment.",
        "external": "Outside influences strain endurance. Circumstances either justify surrender or call for renewed fight.",
        "hopes_fears": "You fear both giving up and continuing. Persistence and surrender both feel wrong.",
        "hidden_influences": "A hidden factor affects whether persistence serves. Something not visible determines if fighting on is wise.",
        "obstacles": "The obstacle is misapplied will. What blocks you is either premature surrender or foolish persistence.",
        "external_influences": "External forces strain persistence. The world either demands surrender or requires renewed fight."
      }
    },
    "Ten of Wands": {
      "upright": {
        "todays_guidance": "Today notice the burden you carry. Responsibilities accumulate, success becomes weight. The day asks if you're carrying too much.",
        "past": "Heavy burden shaped your path. A time when you took on too much, when responsibility accumulated. That weight brought you here.",
        "present": "Right now you carry a heavy load. Responsibilities stack up, success has become burden. This moment is the ten wands.",
        "future": "Burden approaches. What's coming adds weight. Prepare to carry—or prepare to delegate.",
        "situation": "The situation involves heavy burden. Too much responsibility taken on, success become weight. Something must shift.",
        "action": "Assess the load. Consider delegation. The action required addresses what you're carrying—is it all yours to bear?",
        "outcome": "This leads to either continued burden or release. The outcome depends on whether you keep carrying or share the load.",
        "challenge": "The challenge is the weight itself. You carry too much, and the burden threatens to crush. Release or redistribution is needed.",
        "above": "Your highest possibility is wise distribution of burden. The best outcome involves carrying only what's truly yours.",
        "below": "Beneath this situation lies compulsion to carry. Unconscious belief you must do everything shapes the overburden.",
        "advice": "Put something down. The guidance is to delegate, release, or at minimum acknowledge the weight. Not all of this is yours to carry.",
        "external": "Outside influences add burden. Others expect you to carry, circumstances pile responsibilities. The world puts weight on you.",
        "hopes_fears": "You hope to reach the destination despite the load—and fear collapsing before you get there. The burden feels impossible but necessary.",
        "hidden_influences": "A hidden factor is why you carry so much. Something not visible drives the accumulation of burden.",
        "obstacles": "The obstacle is the weight itself. What blocks you is carrying too much—forward movement becomes impossible.",
        "external_influences": "External forces add burden. The world piles responsibilities and expects you to carry them all."
      },
      "reversed": {
        "todays_guidance": "Today notice released burden or shirked responsibility. Either putting down what crushed you or dropping what shouldn't be dropped. Which is it?",
        "past": "Released burden or shirked responsibility shaped your path. A time when weight was finally put down or improperly abandoned. That release echoes.",
        "present": "Right now burden shifts. Either finally putting down crushing weight or avoiding responsibility. The load changes.",
        "future": "Ahead lies reckoning with burden. What's coming involves either proper release or consequences of shirking.",
        "situation": "The situation involves shifted burden. Either healthy release of weight or problematic abandonment of responsibility.",
        "action": "Assess what's been put down. If it's healthy release, accept it. If it's shirking, address it. The action needed depends on which is happening.",
        "outcome": "This leads to consequences of released or shirked burden. The result depends on whether release was wise or irresponsible.",
        "challenge": "The challenge is right relationship with responsibility. Either you're releasing healthily or abandoning improperly.",
        "above": "Your best hope involves wise release of burden. The highest outcome requires carrying only what's truly yours.",
        "below": "Beneath this situation lies reaction to burden. Unconscious rejection of weight shapes the release—healthy or not.",
        "advice": "Assess honestly. Was the release wise or is it shirking? The guidance requires knowing which pattern is active.",
        "external": "Outside influences affect burden. Circumstances either justify release or reveal shirking.",
        "hopes_fears": "You hope the release is wise—and fear you've abandoned responsibility. Freedom from burden feels both relief and guilt.",
        "hidden_influences": "A hidden factor is the nature of the release. Something not visible determines whether putting down burden was wise.",
        "obstacles": "The obstacle is confusion about responsibility. What blocks you is not knowing what's truly yours to carry.",
        "external_influences": "External forces affect burden distribution. The world either accepts your release or demands you pick the weight back up."
      }
    },
    "Page of Wands": {
      "upright": {
        "todays_guidance": "Today explore with enthusiasm. New ideas call, adventure beckons. The day brings youthful creative energy—follow curiosity.",
        "past": "Enthusiastic exploration shaped your path. A time when curiosity led, when new creative ideas were followed. That youthful energy brought you here.",
        "present": "Right now creative curiosity is alive. New ideas call, enthusiasm builds. This moment is the spark of exploration.",
        "future": "Creative opportunity approaches. What's coming brings new ideas and enthusiastic beginnings. Prepare to explore.",
        "situation": "The situation involves youthful creative energy. Curiosity, new ideas, enthusiastic exploration. Follow what sparks interest.",
        "action": "Explore enthusiastically. Follow creative curiosity. The action required is youthful engagement with new ideas.",
        "outcome": "This leads to creative discovery. What curiosity finds depends on where exploration leads. The outcome rewards enthusiasm.",
        "challenge": "The challenge is directing enthusiasm. Creative energy is abundant but scattered. Curiosity needs focusing.",
        "above": "Your highest possibility is focused creative exploration. The best outcome involves enthusiastic discovery well-directed.",
        "below": "Beneath this situation lies creative yearning. Unconscious desire to explore and create shapes the enthusiasm.",
        "advice": "Follow the spark. The guidance is to explore what calls with youthful enthusiasm. Curiosity leads somewhere worth going.",
        "external": "Outside influences bring creative opportunity. Messages about new ventures, invitations to explore. The world offers adventure.",
        "hopes_fears": "You hope creative exploration leads somewhere—and fear enthusiasm without result. The spark feels both exciting and uncertain.",
        "hidden_influences": "A hidden factor is where exploration leads. Something not visible shapes the outcome of following curiosity.",
        "obstacles": "The obstacle is what blocks exploration. What prevents you from following creative curiosity must be addressed.",
        "external_influences": "External forces bring creative opportunity. The world presents new ideas and invitations to explore."
      },
      "reversed": {
        "todays_guidance": "Today notice scattered energy or stifled creativity. Enthusiasm without direction, or youthful spark suppressed. Where is creative exploration failing?",
        "past": "Scattered energy or stifled creativity shaped your path. A time when enthusiasm went nowhere or curiosity was suppressed. That unfocused or blocked energy echoes.",
        "present": "Right now creative energy is scattered or blocked. Enthusiasm without direction, or spark stifled. Exploration isn't happening productively.",
        "future": "Ahead lies reckoning with blocked creativity. What's coming involves either focusing scattered energy or releasing stifled spark.",
        "situation": "The situation involves troubled creative energy. Either scattered enthusiasm or suppressed curiosity. Something about youthful exploration is wrong.",
        "action": "Focus or release. Either direct scattered energy or unstifle blocked creativity. The action needed addresses the specific problem.",
        "outcome": "This leads to consequences of blocked or scattered creativity. The result shows what happens when youthful energy is mishandled.",
        "challenge": "The challenge is creative energy mishandled. Either too scattered to produce or too stifled to emerge.",
        "above": "Your best hope involves proper creative expression. The highest outcome requires either focus or release.",
        "below": "Beneath this situation lies frustrated creative energy. Unconscious blocks or scattering shapes the troubled enthusiasm.",
        "advice": "Identify the problem. Is energy scattered or stifled? The guidance depends on accurate diagnosis.",
        "external": "Outside influences scatter or stifle creativity. Circumstances disperse focus or suppress enthusiasm.",
        "hopes_fears": "You fear creative energy is wasted—enthusiasm going nowhere, spark never igniting. The scattered or stifled state feels discouraging.",
        "hidden_influences": "A hidden factor blocks or scatters creativity. Something not visible prevents focused enthusiastic exploration.",
        "obstacles": "The obstacle is mishandled creative energy. What blocks you is either excessive scattering or inappropriate suppression.",
        "external_influences": "External forces scatter or stifle creativity. The world disrupts focus or suppresses youthful enthusiasm."
      }
    },
    "Knight of Wands": {
      "upright": {
        "todays_guidance": "Today charge forward boldly. Passion and action combine. The day calls for fearless pursuit—move with courage and fire.",
        "past": "Bold passionate action shaped your path. A time when you charged forward fearlessly. That fiery pursuit brought you here.",
        "present": "Right now bold action is called for. Passion demands expression through movement. This moment is the charge.",
        "future": "Bold action approaches. What's coming requires passionate forward movement. Prepare to charge.",
        "situation": "The situation calls for bold pursuit. Passion demands action, fearless movement is needed. Charge forward.",
        "action": "Act boldly. Move with passion. The action required is fearless forward movement, not hesitation.",
        "outcome": "This leads through bold action. What passion pursues is what's achieved. The outcome reflects the charge's direction.",
        "challenge": "The challenge is directing boldness. Passion is strong but aim matters. Fearless action needs worthy target.",
        "above": "Your highest possibility is focused passionate achievement. The best outcome involves bold action well-directed.",
        "below": "Beneath this situation lies fire seeking expression. Unconscious passion drives the urge to charge.",
        "advice": "Charge forward. The guidance is to act boldly on passion. Hesitation serves nothing here.",
        "external": "Outside influences call for bold action. Circumstances demand passionate response. The world rewards those who charge.",
        "hopes_fears": "You hope bold action succeeds—and fear passion leads astray. The charge feels both necessary and risky.",
        "hidden_influences": "A hidden factor is where the charge leads. Something not visible shapes the outcome of bold action.",
        "obstacles": "The obstacle is what blocks the charge. What prevents bold forward movement must be overcome or circumvented.",
        "external_influences": "External forces call for bold action. The world presents opportunities that reward passionate pursuit."
      },
      "reversed": {
        "todays_guidance": "Today notice reckless action or frustrated passion. Either charging without direction or passion blocked from movement. Which is happening?",
        "past": "Reckless action or frustrated passion shaped your path. A time when bold movement went wrong or fire couldn't express. That pattern echoes.",
        "present": "Right now bold action is troubled. Either moving recklessly or unable to move at all. Passion is misdirected or blocked.",
        "future": "Ahead lies reckoning with troubled action. What's coming involves either directing passion properly or unblocking it.",
        "situation": "The situation involves misdirected or blocked passion. Either reckless action or frustrated stagnation. Fire isn't serving well.",
        "action": "Pause and aim, or clear the block. If reckless, direct. If frustrated, unblock. The action depends on which problem is active.",
        "outcome": "This leads to consequences of troubled passion. The result shows what happens when bold energy is misdirected or stuck.",
        "challenge": "The challenge is passion mishandled. Either recklessness or frustration—fire isn't expressing properly.",
        "above": "Your best hope involves directed passionate action. The highest outcome requires either focus or release.",
        "below": "Beneath this situation lies frustrated or undirected fire. Unconscious issues with passion shape the trouble.",
        "advice": "Identify the problem. Reckless or blocked? The guidance requires knowing which pattern needs addressing.",
        "external": "Outside influences misdirect or block passion. Circumstances either encourage recklessness or frustrate action.",
        "hopes_fears": "You fear passion will never express properly—either burning out of control or never igniting. The fire feels dangerous either way.",
        "hidden_influences": "A hidden factor troubles passionate action. Something not visible causes recklessness or blockage.",
        "obstacles": "The obstacle is troubled passion. What blocks you is either reckless misdirection or frustrated stagnation.",
        "external_influences": "External forces trouble passionate action. The world either enables recklessness or blocks necessary bold movement."
      }
    },
    "Queen of Wands": {
      "upright": {
        "todays_guidance": "Today embody confident warmth. Lead with charisma, inspire through presence. The day calls for the Queen's magnetic command.",
        "past": "Confident charismatic leadership shaped your path. A time when warm authority inspired. That magnetic presence brought you here.",
        "present": "Right now confident warmth is available. Lead with charisma, command through presence. This moment asks for the Queen's fire.",
        "future": "Charismatic power approaches. What's coming calls for confident inspiring presence. Prepare to lead with warmth.",
        "situation": "The situation calls for confident charismatic leadership. Warm authority that inspires rather than dominates. The Queen's way.",
        "action": "Lead with warmth. Command through presence. The action required is confident charismatic authority.",
        "outcome": "This leads to inspired following. What the Queen's warmth commands willingly follows. The outcome is charismatic success.",
        "challenge": "The challenge is embodying confident warmth. The Queen's energy is needed but may feel unfamiliar. Own it anyway.",
        "above": "Your highest possibility is magnetic charismatic leadership. The best outcome involves full Queen of Wands embodiment.",
        "below": "Beneath this situation lies fire seeking worthy expression. Unconscious charisma shapes events waiting to be consciously claimed.",
        "advice": "Own your fire. The guidance is to lead with confident warmth. You have the Queen's energy—use it.",
        "external": "Outside influences involve charismatic presence. Someone embodies the Queen's warmth, or circumstances call you to it.",
        "hopes_fears": "You hope to lead with inspiring warmth—and fear your fire is too much or not enough. The Queen's power feels both natural and daunting.",
        "hidden_influences": "A hidden factor is charismatic influence. Something not visible involves warm authority shaping events.",
        "obstacles": "The obstacle is blocked charisma. What prevents you from embodying the Queen's confident warmth must be addressed.",
        "external_influences": "External forces call for charismatic leadership. The world responds to confident warm authority."
      },
      "reversed": {
        "todays_guidance": "Today notice distorted confidence or blocked warmth. Either dominating instead of inspiring, or fire suppressed entirely. Which shadow is active?",
        "past": "Distorted confidence or blocked warmth shaped your path. A time when charisma was misused or suppressed. That pattern echoes.",
        "present": "Right now the Queen's energy is troubled. Either dominating, jealous, and overheated, or fire suppressed entirely.",
        "future": "Ahead lies reckoning with blocked or distorted warmth. What's coming involves either tempering excess or releasing suppression.",
        "situation": "The situation involves troubled charismatic energy. Either too much fire burning destructively or not enough expression.",
        "action": "Address the distortion. Temper excess or release suppression. The action needed depends on which shadow is active.",
        "outcome": "This leads to consequences of troubled fire. The result shows what happens when warmth distorts or suppresses.",
        "challenge": "The challenge is the Queen's shadow. Either dominating arrogance or collapsed confidence. Fire isn't expressing healthily.",
        "above": "Your best hope involves balanced confident warmth. The highest outcome requires addressing whatever distorts the Queen's fire.",
        "below": "Beneath this situation lies wounded relationship with power. Unconscious issues with confidence shape the troubled expression.",
        "advice": "Find the balance. Neither dominate nor suppress. The guidance is to embody warmth without burning or hiding.",
        "external": "Outside influences distort or suppress warmth. Someone models the Queen's shadow, or circumstances block confident expression.",
        "hopes_fears": "You fear fire is uncontrollable—either burning others or burning out entirely. The Queen's power feels dangerous.",
        "hidden_influences": "A hidden factor distorts warmth. Something not visible causes the excess or suppression of confident charisma.",
        "obstacles": "The obstacle is troubled fire. What blocks you is either dominating arrogance or suppressed confidence.",
        "external_influences": "External forces distort the Queen's energy. The world either feeds arrogance or suppresses warmth."
      }
    },
    "King of Wands": {
      "upright": {
        "todays_guidance": "Today lead with bold vision. Command through inspiration, turn dreams to reality. The day calls for the King's visionary authority.",
        "past": "Bold visionary leadership shaped your path. A time when you commanded through inspiration. That kingly fire brought you here.",
        "present": "Right now visionary leadership is called for. Command through inspiration, lead with bold vision. This moment asks for the King.",
        "future": "Visionary authority approaches. What's coming calls for the King's bold inspired leadership. Prepare to command.",
        "situation": "The situation calls for visionary leadership. Bold authority that inspires action, vision that becomes reality. The King's way.",
        "action": "Lead with vision. Command through inspiration. The action required is the King's bold visionary authority.",
        "outcome": "This leads to vision realized. What the King's authority commands becomes real. The outcome is inspired achievement.",
        "challenge": "The challenge is embodying the King's vision. Bold inspired leadership is needed but may feel presumptuous. Lead anyway.",
        "above": "Your highest possibility is visionary achievement. The best outcome involves full King of Wands embodiment.",
        "below": "Beneath this situation lies vision seeking manifestation. Unconscious leadership shapes events waiting to be consciously commanded.",
        "advice": "Lead boldly. The guidance is to command through vision and inspire through fire. You have the King's energy—use it.",
        "external": "Outside influences involve visionary leadership. Someone embodies the King's authority, or circumstances call you to it.",
        "hopes_fears": "You hope to lead with inspiring vision—and fear presumption or failure. The King's authority feels both right and daunting.",
        "hidden_influences": "A hidden factor is visionary influence. Something not visible involves bold leadership shaping events.",
        "obstacles": "The obstacle blocks visionary leadership. What prevents you from embodying the King's bold authority must be addressed.",
        "external_influences": "External forces call for visionary leadership. The world responds to bold inspired command."
      },
      "reversed": {
        "todays_guidance": "Today notice tyrannical leadership or uninspired authority. Either dominating without vision or leading without fire. Which shadow is active?",
        "past": "Tyrannical or uninspired leadership shaped your path. A time when authority was abused or vision was lacking. That pattern echoes.",
        "present": "Right now the King's energy is troubled. Either dominating without inspiration or leading without conviction.",
        "future": "Ahead lies reckoning with troubled authority. What's coming involves either tempering tyranny or finding vision.",
        "situation": "The situation involves troubled leadership. Either tyrannical domination or uninspired authority. Something about the King is wrong.",
        "action": "Address the shadow. Either temper domination or find vision. The action needed depends on which problem is active.",
        "outcome": "This leads to consequences of troubled leadership. The result shows what happens when authority is abused or lacks vision.",
        "challenge": "The challenge is the King's shadow. Either tyrannical domination or spineless leadership. Fire isn't serving properly.",
        "above": "Your best hope involves balanced visionary leadership. The highest outcome requires addressing whatever troubles authority.",
        "below": "Beneath this situation lies wounded relationship with power. Unconscious issues with authority shape the troubled expression.",
        "advice": "Find the balance. Lead with vision, not ego. Or find the fire you've lost. The guidance depends on which shadow is active.",
        "external": "Outside influences distort leadership. Someone models the King's shadow, or circumstances corrupt or drain authority.",
        "hopes_fears": "You fear authority gone wrong—either tyrannizing or failing to lead at all. The King's power feels problematic.",
        "hidden_influences": "A hidden factor distorts leadership. Something not visible causes tyranny or drains vision.",
        "obstacles": "The obstacle is troubled authority. What blocks you is either dominating ego or absent vision.",
        "external_influences": "External forces distort the King's energy. The world either feeds tyranny or undermines inspired leadership."
      }
    }
  }
}
